#![allow(non_camel_case_types)]
#![allow(non_snake_case)]
#![allow(non_upper_case_globals)]
#![allow(unused)]

/* automatically generated by rust-bindgen 0.71.1 */

pub const _STDIO_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __TIMESIZE: u32 = 64;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_60559_BFP__: u32 = 201404;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_IEC_60559_COMPLEX__: u32 = 201404;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;
pub const __GLIBC_MINOR__: u32 = 35;

pub const P_tmpdir: &[u8; 5] = b"/tmp\0";
pub const _BITS_STDIO_LIM_H: u32 = 1;
pub const L_tmpnam: u32 = 20;
pub const TMP_MAX: u32 = 238328;
pub const FILENAME_MAX: u32 = 4096;
pub const L_ctermid: u32 = 9;
pub const FOPEN_MAX: u32 = 16;
pub const __HAVE_FLOAT128: u32 = 0;
pub const __HAVE_DISTINCT_FLOAT128: u32 = 0;
pub const __HAVE_FLOAT64X: u32 = 1;
pub const __HAVE_FLOAT64X_LONG_DOUBLE: u32 = 1;
pub const __HAVE_FLOAT16: u32 = 0;
pub const __HAVE_FLOAT32: u32 = 1;
pub const __HAVE_FLOAT64: u32 = 1;
pub const __HAVE_FLOAT32X: u32 = 1;
pub const __HAVE_FLOAT128X: u32 = 0;
pub const __HAVE_DISTINCT_FLOAT16: u32 = 0;
pub const __HAVE_DISTINCT_FLOAT32: u32 = 0;
pub const __HAVE_DISTINCT_FLOAT64: u32 = 0;
pub const __HAVE_DISTINCT_FLOAT32X: u32 = 0;
pub const __HAVE_DISTINCT_FLOAT64X: u32 = 0;
pub const __HAVE_DISTINCT_FLOAT128X: u32 = 0;
pub const __HAVE_FLOATN_NOT_TYPEDEF: u32 = 0;
pub const LEFW_OK: u32 = 0;
pub const LEFW_UNINITIALIZED: u32 = 1;
pub const LEFW_BAD_ORDER: u32 = 2;
pub const LEFW_BAD_DATA: u32 = 3;
pub const LEFW_ALREADY_DEFINED: u32 = 4;
pub const LEFW_WRONG_VERSION: u32 = 5;
pub const LEFW_MIX_VERSION_DATA: u32 = 6;
pub const LEFW_OBSOLETE: u32 = 7;
pub const MAX_LEF_MSGS: u32 = 4701;
pub const PARSE_OK: u32 = 0;
pub const STOP_PARSE: u32 = 1;
pub const PARSE_ERROR: u32 = 2;
pub type __gnuc_va_list = __builtin_va_list;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __fsid_t"][::std::mem::size_of::<__fsid_t>() - 8usize];
    ["Alignment of __fsid_t"][::std::mem::align_of::<__fsid_t>() - 4usize];
    ["Offset of field: __fsid_t::__val"][::std::mem::offset_of!(__fsid_t, __val) - 0usize];
};
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t__bindgen_ty_1"]
        [::std::mem::size_of::<__mbstate_t__bindgen_ty_1>() - 4usize];
    ["Alignment of __mbstate_t__bindgen_ty_1"]
        [::std::mem::align_of::<__mbstate_t__bindgen_ty_1>() - 4usize];
    ["Offset of field: __mbstate_t__bindgen_ty_1::__wch"]
        [::std::mem::offset_of!(__mbstate_t__bindgen_ty_1, __wch) - 0usize];
    ["Offset of field: __mbstate_t__bindgen_ty_1::__wchb"]
        [::std::mem::offset_of!(__mbstate_t__bindgen_ty_1, __wchb) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t"][::std::mem::size_of::<__mbstate_t>() - 8usize];
    ["Alignment of __mbstate_t"][::std::mem::align_of::<__mbstate_t>() - 4usize];
    ["Offset of field: __mbstate_t::__count"]
        [::std::mem::offset_of!(__mbstate_t, __count) - 0usize];
    ["Offset of field: __mbstate_t::__value"]
        [::std::mem::offset_of!(__mbstate_t, __value) - 4usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _G_fpos_t"][::std::mem::size_of::<_G_fpos_t>() - 16usize];
    ["Alignment of _G_fpos_t"][::std::mem::align_of::<_G_fpos_t>() - 8usize];
    ["Offset of field: _G_fpos_t::__pos"][::std::mem::offset_of!(_G_fpos_t, __pos) - 0usize];
    ["Offset of field: _G_fpos_t::__state"][::std::mem::offset_of!(_G_fpos_t, __state) - 8usize];
};
pub type __fpos_t = _G_fpos_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _G_fpos64_t"][::std::mem::size_of::<_G_fpos64_t>() - 16usize];
    ["Alignment of _G_fpos64_t"][::std::mem::align_of::<_G_fpos64_t>() - 8usize];
    ["Offset of field: _G_fpos64_t::__pos"][::std::mem::offset_of!(_G_fpos64_t, __pos) - 0usize];
    ["Offset of field: _G_fpos64_t::__state"]
        [::std::mem::offset_of!(_G_fpos64_t, __state) - 8usize];
};
pub type __fpos64_t = _G_fpos64_t;
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut ::std::os::raw::c_void,
    pub __pad5: usize,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_FILE"][::std::mem::size_of::<_IO_FILE>() - 216usize];
    ["Alignment of _IO_FILE"][::std::mem::align_of::<_IO_FILE>() - 8usize];
    ["Offset of field: _IO_FILE::_flags"][::std::mem::offset_of!(_IO_FILE, _flags) - 0usize];
    ["Offset of field: _IO_FILE::_IO_read_ptr"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_ptr) - 8usize];
    ["Offset of field: _IO_FILE::_IO_read_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_end) - 16usize];
    ["Offset of field: _IO_FILE::_IO_read_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_base) - 24usize];
    ["Offset of field: _IO_FILE::_IO_write_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_base) - 32usize];
    ["Offset of field: _IO_FILE::_IO_write_ptr"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_ptr) - 40usize];
    ["Offset of field: _IO_FILE::_IO_write_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_end) - 48usize];
    ["Offset of field: _IO_FILE::_IO_buf_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_buf_base) - 56usize];
    ["Offset of field: _IO_FILE::_IO_buf_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_buf_end) - 64usize];
    ["Offset of field: _IO_FILE::_IO_save_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_save_base) - 72usize];
    ["Offset of field: _IO_FILE::_IO_backup_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_backup_base) - 80usize];
    ["Offset of field: _IO_FILE::_IO_save_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_save_end) - 88usize];
    ["Offset of field: _IO_FILE::_markers"][::std::mem::offset_of!(_IO_FILE, _markers) - 96usize];
    ["Offset of field: _IO_FILE::_chain"][::std::mem::offset_of!(_IO_FILE, _chain) - 104usize];
    ["Offset of field: _IO_FILE::_fileno"][::std::mem::offset_of!(_IO_FILE, _fileno) - 112usize];
    ["Offset of field: _IO_FILE::_flags2"][::std::mem::offset_of!(_IO_FILE, _flags2) - 116usize];
    ["Offset of field: _IO_FILE::_old_offset"]
        [::std::mem::offset_of!(_IO_FILE, _old_offset) - 120usize];
    ["Offset of field: _IO_FILE::_cur_column"]
        [::std::mem::offset_of!(_IO_FILE, _cur_column) - 128usize];
    ["Offset of field: _IO_FILE::_vtable_offset"]
        [::std::mem::offset_of!(_IO_FILE, _vtable_offset) - 130usize];
    ["Offset of field: _IO_FILE::_shortbuf"]
        [::std::mem::offset_of!(_IO_FILE, _shortbuf) - 131usize];
    ["Offset of field: _IO_FILE::_lock"][::std::mem::offset_of!(_IO_FILE, _lock) - 136usize];
    ["Offset of field: _IO_FILE::_offset"][::std::mem::offset_of!(_IO_FILE, _offset) - 144usize];
    ["Offset of field: _IO_FILE::_codecvt"][::std::mem::offset_of!(_IO_FILE, _codecvt) - 152usize];
    ["Offset of field: _IO_FILE::_wide_data"]
        [::std::mem::offset_of!(_IO_FILE, _wide_data) - 160usize];
    ["Offset of field: _IO_FILE::_freeres_list"]
        [::std::mem::offset_of!(_IO_FILE, _freeres_list) - 168usize];
    ["Offset of field: _IO_FILE::_freeres_buf"]
        [::std::mem::offset_of!(_IO_FILE, _freeres_buf) - 176usize];
    ["Offset of field: _IO_FILE::__pad5"][::std::mem::offset_of!(_IO_FILE, __pad5) - 184usize];
    ["Offset of field: _IO_FILE::_mode"][::std::mem::offset_of!(_IO_FILE, _mode) - 192usize];
    ["Offset of field: _IO_FILE::_unused2"][::std::mem::offset_of!(_IO_FILE, _unused2) - 196usize];
};
pub type va_list = __gnuc_va_list;
pub type off_t = __off_t;
pub type fpos_t = __fpos_t;
unsafe extern "C" {
    pub static mut stdin: *mut FILE;
}
unsafe extern "C" {
    pub static mut stdout: *mut FILE;
}
unsafe extern "C" {
    pub static mut stderr: *mut FILE;
}
unsafe extern "C" {
    pub fn remove(__filename: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn rename(
        __old: *const ::std::os::raw::c_char,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn renameat(
        __oldfd: ::std::os::raw::c_int,
        __old: *const ::std::os::raw::c_char,
        __newfd: ::std::os::raw::c_int,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
unsafe extern "C" {
    pub fn tmpnam(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn tmpnam_r(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn tempnam(
        __dir: *const ::std::os::raw::c_char,
        __pfx: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fflush(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn freopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fdopen(__fd: ::std::os::raw::c_int, __modes: *const ::std::os::raw::c_char)
        -> *mut FILE;
}
unsafe extern "C" {
    pub fn fmemopen(
        __s: *mut ::std::os::raw::c_void,
        __len: usize,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn open_memstream(
        __bufloc: *mut *mut ::std::os::raw::c_char,
        __sizeloc: *mut usize,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn setvbuf(
        __stream: *mut FILE,
        __buf: *mut ::std::os::raw::c_char,
        __modes: ::std::os::raw::c_int,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char, __size: usize);
}
unsafe extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn fprintf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn printf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vfprintf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vprintf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn snprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsnprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vdprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn dprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fscanf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn scanf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_fscanf"]
    pub fn fscanf1(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_scanf"]
    pub fn scanf1(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_sscanf"]
    pub fn sscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vfscanf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vscanf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_vfscanf"]
    pub fn vfscanf1(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_vscanf"]
    pub fn vscanf1(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}__isoc99_vsscanf"]
    pub fn vsscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fputc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putchar(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fputc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE)
        -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putchar_unlocked(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getw(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putw(__w: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgets(
        __s: *mut ::std::os::raw::c_char,
        __n: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn __getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
unsafe extern "C" {
    pub fn getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
unsafe extern "C" {
    pub fn getline(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
unsafe extern "C" {
    pub fn fputs(__s: *const ::std::os::raw::c_char, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn puts(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ungetc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fread(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn fwrite(
        __ptr: *const ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __s: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn fread_unlocked(
        __ptr: *mut ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
unsafe extern "C" {
    pub fn fwrite_unlocked(
        __ptr: *const ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
unsafe extern "C" {
    pub fn fseek(
        __stream: *mut FILE,
        __off: ::std::os::raw::c_long,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ftell(__stream: *mut FILE) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __off: __off_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
unsafe extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn feof(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ferror(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn perror(__s: *const ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn fileno(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn popen(
        __command: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn ctermid(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
unsafe extern "C" {
    pub fn __uflow(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __overflow(arg1: *mut FILE, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
pub type lefiNum = lefiPoints;
pub type lefiArrayFloorPlan = *mut ::std::os::raw::c_void;
pub type lefiLayer = *mut ::std::os::raw::c_void;
pub type lefiNoiseEdge = *mut ::std::os::raw::c_void;
pub type lefiAntennaModel = *mut ::std::os::raw::c_void;
pub type lefiCorrectionEdge = *mut ::std::os::raw::c_void;
pub type lefiTrackPattern = *mut ::std::os::raw::c_void;
pub type lefiIRDrop = *mut ::std::os::raw::c_void;
pub type lefiGeometries = *mut ::std::os::raw::c_void;
pub type lefiSpacingTable = *mut ::std::os::raw::c_void;
pub type lefiMinFeature = *mut ::std::os::raw::c_void;
pub type lefiGcellPattern = *mut ::std::os::raw::c_void;
pub type lefiTiming = *mut ::std::os::raw::c_void;
pub type lefiNoiseTable = *mut ::std::os::raw::c_void;
pub type lefiCorrectionVictim = *mut ::std::os::raw::c_void;
pub type lefiPinAntennaModel = *mut ::std::os::raw::c_void;
pub type lefiProp = *mut ::std::os::raw::c_void;
pub type lefiUseMinSpacing = *mut ::std::os::raw::c_void;
pub type lefiCorrectionResistance = *mut ::std::os::raw::c_void;
pub type lefiAntennaPWL = *mut ::std::os::raw::c_void;
pub type lefiArray = *mut ::std::os::raw::c_void;
pub type lefiNonDefault = *mut ::std::os::raw::c_void;
pub type lefiLayerDensity = *mut ::std::os::raw::c_void;
pub type lefiSitePattern = *mut ::std::os::raw::c_void;
pub type lefiMacro = *mut ::std::os::raw::c_void;
pub type lefiCorrectionTable = *mut ::std::os::raw::c_void;
pub type lefiOrthogonal = *mut ::std::os::raw::c_void;
pub type lefiVia = *mut ::std::os::raw::c_void;
pub type lefiSite = *mut ::std::os::raw::c_void;
pub type lefiViaLayer = *mut ::std::os::raw::c_void;
pub type lefiParallel = *mut ::std::os::raw::c_void;
pub type lefiNoiseVictim = *mut ::std::os::raw::c_void;
pub type lefiSpacing = *mut ::std::os::raw::c_void;
pub type lefiViaRule = *mut ::std::os::raw::c_void;
pub type lefiViaRuleLayer = *mut ::std::os::raw::c_void;
pub type lefiTwoWidths = *mut ::std::os::raw::c_void;
pub type lefiDensity = *mut ::std::os::raw::c_void;
pub type lefiPin = *mut ::std::os::raw::c_void;
pub type lefiMaxStackVia = *mut ::std::os::raw::c_void;
pub type lefiInfluence = *mut ::std::os::raw::c_void;
pub type lefiUnits = *mut ::std::os::raw::c_void;
pub type lefiPropType = *mut ::std::os::raw::c_void;
pub type lefiObstruction = *mut ::std::os::raw::c_void;
pub type lefiNoiseResistance = *mut ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lefiNoiseMargin {
    pub high: f64,
    pub low: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lefiNoiseMargin"][::std::mem::size_of::<lefiNoiseMargin>() - 16usize];
    ["Alignment of lefiNoiseMargin"][::std::mem::align_of::<lefiNoiseMargin>() - 8usize];
    ["Offset of field: lefiNoiseMargin::high"]
        [::std::mem::offset_of!(lefiNoiseMargin, high) - 0usize];
    ["Offset of field: lefiNoiseMargin::low"]
        [::std::mem::offset_of!(lefiNoiseMargin, low) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lefiGeomRect {
    pub xl: f64,
    pub yl: f64,
    pub xh: f64,
    pub yh: f64,
    pub colorMask: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lefiGeomRect"][::std::mem::size_of::<lefiGeomRect>() - 40usize];
    ["Alignment of lefiGeomRect"][::std::mem::align_of::<lefiGeomRect>() - 8usize];
    ["Offset of field: lefiGeomRect::xl"][::std::mem::offset_of!(lefiGeomRect, xl) - 0usize];
    ["Offset of field: lefiGeomRect::yl"][::std::mem::offset_of!(lefiGeomRect, yl) - 8usize];
    ["Offset of field: lefiGeomRect::xh"][::std::mem::offset_of!(lefiGeomRect, xh) - 16usize];
    ["Offset of field: lefiGeomRect::yh"][::std::mem::offset_of!(lefiGeomRect, yh) - 24usize];
    ["Offset of field: lefiGeomRect::colorMask"]
        [::std::mem::offset_of!(lefiGeomRect, colorMask) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lefiGeomRectIter {
    pub xl: f64,
    pub yl: f64,
    pub xh: f64,
    pub yh: f64,
    pub xStart: f64,
    pub yStart: f64,
    pub xStep: f64,
    pub yStep: f64,
    pub colorMask: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lefiGeomRectIter"][::std::mem::size_of::<lefiGeomRectIter>() - 72usize];
    ["Alignment of lefiGeomRectIter"][::std::mem::align_of::<lefiGeomRectIter>() - 8usize];
    ["Offset of field: lefiGeomRectIter::xl"]
        [::std::mem::offset_of!(lefiGeomRectIter, xl) - 0usize];
    ["Offset of field: lefiGeomRectIter::yl"]
        [::std::mem::offset_of!(lefiGeomRectIter, yl) - 8usize];
    ["Offset of field: lefiGeomRectIter::xh"]
        [::std::mem::offset_of!(lefiGeomRectIter, xh) - 16usize];
    ["Offset of field: lefiGeomRectIter::yh"]
        [::std::mem::offset_of!(lefiGeomRectIter, yh) - 24usize];
    ["Offset of field: lefiGeomRectIter::xStart"]
        [::std::mem::offset_of!(lefiGeomRectIter, xStart) - 32usize];
    ["Offset of field: lefiGeomRectIter::yStart"]
        [::std::mem::offset_of!(lefiGeomRectIter, yStart) - 40usize];
    ["Offset of field: lefiGeomRectIter::xStep"]
        [::std::mem::offset_of!(lefiGeomRectIter, xStep) - 48usize];
    ["Offset of field: lefiGeomRectIter::yStep"]
        [::std::mem::offset_of!(lefiGeomRectIter, yStep) - 56usize];
    ["Offset of field: lefiGeomRectIter::colorMask"]
        [::std::mem::offset_of!(lefiGeomRectIter, colorMask) - 64usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lefiGeomPath {
    pub numPoints: ::std::os::raw::c_int,
    pub x: *mut f64,
    pub y: *mut f64,
    pub colorMask: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lefiGeomPath"][::std::mem::size_of::<lefiGeomPath>() - 32usize];
    ["Alignment of lefiGeomPath"][::std::mem::align_of::<lefiGeomPath>() - 8usize];
    ["Offset of field: lefiGeomPath::numPoints"]
        [::std::mem::offset_of!(lefiGeomPath, numPoints) - 0usize];
    ["Offset of field: lefiGeomPath::x"][::std::mem::offset_of!(lefiGeomPath, x) - 8usize];
    ["Offset of field: lefiGeomPath::y"][::std::mem::offset_of!(lefiGeomPath, y) - 16usize];
    ["Offset of field: lefiGeomPath::colorMask"]
        [::std::mem::offset_of!(lefiGeomPath, colorMask) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lefiGeomPathIter {
    pub numPoints: ::std::os::raw::c_int,
    pub x: *mut f64,
    pub y: *mut f64,
    pub xStart: f64,
    pub yStart: f64,
    pub xStep: f64,
    pub yStep: f64,
    pub colorMask: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lefiGeomPathIter"][::std::mem::size_of::<lefiGeomPathIter>() - 64usize];
    ["Alignment of lefiGeomPathIter"][::std::mem::align_of::<lefiGeomPathIter>() - 8usize];
    ["Offset of field: lefiGeomPathIter::numPoints"]
        [::std::mem::offset_of!(lefiGeomPathIter, numPoints) - 0usize];
    ["Offset of field: lefiGeomPathIter::x"][::std::mem::offset_of!(lefiGeomPathIter, x) - 8usize];
    ["Offset of field: lefiGeomPathIter::y"][::std::mem::offset_of!(lefiGeomPathIter, y) - 16usize];
    ["Offset of field: lefiGeomPathIter::xStart"]
        [::std::mem::offset_of!(lefiGeomPathIter, xStart) - 24usize];
    ["Offset of field: lefiGeomPathIter::yStart"]
        [::std::mem::offset_of!(lefiGeomPathIter, yStart) - 32usize];
    ["Offset of field: lefiGeomPathIter::xStep"]
        [::std::mem::offset_of!(lefiGeomPathIter, xStep) - 40usize];
    ["Offset of field: lefiGeomPathIter::yStep"]
        [::std::mem::offset_of!(lefiGeomPathIter, yStep) - 48usize];
    ["Offset of field: lefiGeomPathIter::colorMask"]
        [::std::mem::offset_of!(lefiGeomPathIter, colorMask) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lefiGeomPolygon {
    pub numPoints: ::std::os::raw::c_int,
    pub x: *mut f64,
    pub y: *mut f64,
    pub colorMask: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lefiGeomPolygon"][::std::mem::size_of::<lefiGeomPolygon>() - 32usize];
    ["Alignment of lefiGeomPolygon"][::std::mem::align_of::<lefiGeomPolygon>() - 8usize];
    ["Offset of field: lefiGeomPolygon::numPoints"]
        [::std::mem::offset_of!(lefiGeomPolygon, numPoints) - 0usize];
    ["Offset of field: lefiGeomPolygon::x"][::std::mem::offset_of!(lefiGeomPolygon, x) - 8usize];
    ["Offset of field: lefiGeomPolygon::y"][::std::mem::offset_of!(lefiGeomPolygon, y) - 16usize];
    ["Offset of field: lefiGeomPolygon::colorMask"]
        [::std::mem::offset_of!(lefiGeomPolygon, colorMask) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lefiGeomPolygonIter {
    pub numPoints: ::std::os::raw::c_int,
    pub x: *mut f64,
    pub y: *mut f64,
    pub xStart: f64,
    pub yStart: f64,
    pub xStep: f64,
    pub yStep: f64,
    pub colorMask: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lefiGeomPolygonIter"][::std::mem::size_of::<lefiGeomPolygonIter>() - 64usize];
    ["Alignment of lefiGeomPolygonIter"][::std::mem::align_of::<lefiGeomPolygonIter>() - 8usize];
    ["Offset of field: lefiGeomPolygonIter::numPoints"]
        [::std::mem::offset_of!(lefiGeomPolygonIter, numPoints) - 0usize];
    ["Offset of field: lefiGeomPolygonIter::x"]
        [::std::mem::offset_of!(lefiGeomPolygonIter, x) - 8usize];
    ["Offset of field: lefiGeomPolygonIter::y"]
        [::std::mem::offset_of!(lefiGeomPolygonIter, y) - 16usize];
    ["Offset of field: lefiGeomPolygonIter::xStart"]
        [::std::mem::offset_of!(lefiGeomPolygonIter, xStart) - 24usize];
    ["Offset of field: lefiGeomPolygonIter::yStart"]
        [::std::mem::offset_of!(lefiGeomPolygonIter, yStart) - 32usize];
    ["Offset of field: lefiGeomPolygonIter::xStep"]
        [::std::mem::offset_of!(lefiGeomPolygonIter, xStep) - 40usize];
    ["Offset of field: lefiGeomPolygonIter::yStep"]
        [::std::mem::offset_of!(lefiGeomPolygonIter, yStep) - 48usize];
    ["Offset of field: lefiGeomPolygonIter::colorMask"]
        [::std::mem::offset_of!(lefiGeomPolygonIter, colorMask) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lefiGeomVia {
    pub name: *mut ::std::os::raw::c_char,
    pub x: f64,
    pub y: f64,
    pub topMaskNum: ::std::os::raw::c_int,
    pub cutMaskNum: ::std::os::raw::c_int,
    pub bottomMaskNum: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lefiGeomVia"][::std::mem::size_of::<lefiGeomVia>() - 40usize];
    ["Alignment of lefiGeomVia"][::std::mem::align_of::<lefiGeomVia>() - 8usize];
    ["Offset of field: lefiGeomVia::name"][::std::mem::offset_of!(lefiGeomVia, name) - 0usize];
    ["Offset of field: lefiGeomVia::x"][::std::mem::offset_of!(lefiGeomVia, x) - 8usize];
    ["Offset of field: lefiGeomVia::y"][::std::mem::offset_of!(lefiGeomVia, y) - 16usize];
    ["Offset of field: lefiGeomVia::topMaskNum"]
        [::std::mem::offset_of!(lefiGeomVia, topMaskNum) - 24usize];
    ["Offset of field: lefiGeomVia::cutMaskNum"]
        [::std::mem::offset_of!(lefiGeomVia, cutMaskNum) - 28usize];
    ["Offset of field: lefiGeomVia::bottomMaskNum"]
        [::std::mem::offset_of!(lefiGeomVia, bottomMaskNum) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lefiGeomViaIter {
    pub name: *mut ::std::os::raw::c_char,
    pub x: f64,
    pub y: f64,
    pub xStart: f64,
    pub yStart: f64,
    pub xStep: f64,
    pub yStep: f64,
    pub topMaskNum: ::std::os::raw::c_int,
    pub cutMaskNum: ::std::os::raw::c_int,
    pub bottomMaskNum: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lefiGeomViaIter"][::std::mem::size_of::<lefiGeomViaIter>() - 72usize];
    ["Alignment of lefiGeomViaIter"][::std::mem::align_of::<lefiGeomViaIter>() - 8usize];
    ["Offset of field: lefiGeomViaIter::name"]
        [::std::mem::offset_of!(lefiGeomViaIter, name) - 0usize];
    ["Offset of field: lefiGeomViaIter::x"][::std::mem::offset_of!(lefiGeomViaIter, x) - 8usize];
    ["Offset of field: lefiGeomViaIter::y"][::std::mem::offset_of!(lefiGeomViaIter, y) - 16usize];
    ["Offset of field: lefiGeomViaIter::xStart"]
        [::std::mem::offset_of!(lefiGeomViaIter, xStart) - 24usize];
    ["Offset of field: lefiGeomViaIter::yStart"]
        [::std::mem::offset_of!(lefiGeomViaIter, yStart) - 32usize];
    ["Offset of field: lefiGeomViaIter::xStep"]
        [::std::mem::offset_of!(lefiGeomViaIter, xStep) - 40usize];
    ["Offset of field: lefiGeomViaIter::yStep"]
        [::std::mem::offset_of!(lefiGeomViaIter, yStep) - 48usize];
    ["Offset of field: lefiGeomViaIter::topMaskNum"]
        [::std::mem::offset_of!(lefiGeomViaIter, topMaskNum) - 56usize];
    ["Offset of field: lefiGeomViaIter::cutMaskNum"]
        [::std::mem::offset_of!(lefiGeomViaIter, cutMaskNum) - 60usize];
    ["Offset of field: lefiGeomViaIter::bottomMaskNum"]
        [::std::mem::offset_of!(lefiGeomViaIter, bottomMaskNum) - 64usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lefiPoints {
    pub x: f64,
    pub y: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lefiPoints"][::std::mem::size_of::<lefiPoints>() - 16usize];
    ["Alignment of lefiPoints"][::std::mem::align_of::<lefiPoints>() - 8usize];
    ["Offset of field: lefiPoints::x"][::std::mem::offset_of!(lefiPoints, x) - 0usize];
    ["Offset of field: lefiPoints::y"][::std::mem::offset_of!(lefiPoints, y) - 8usize];
};
unsafe extern "C" {
    pub fn lefiObstruction_geometries(obj: *const lefiObstruction) -> *const lefiGeometries;
}
unsafe extern "C" {
    pub fn lefiObstruction_print(obj: *const lefiObstruction, f: *mut FILE);
}
unsafe extern "C" {
    pub fn lefiPinAntennaModel_hasAntennaGateArea(
        obj: *const lefiPinAntennaModel,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPinAntennaModel_hasAntennaMaxAreaCar(
        obj: *const lefiPinAntennaModel,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPinAntennaModel_hasAntennaMaxSideAreaCar(
        obj: *const lefiPinAntennaModel,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPinAntennaModel_hasAntennaMaxCutCar(
        obj: *const lefiPinAntennaModel,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPinAntennaModel_antennaOxide(
        obj: *const lefiPinAntennaModel,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiPinAntennaModel_numAntennaGateArea(
        obj: *const lefiPinAntennaModel,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPinAntennaModel_antennaGateArea(
        obj: *const lefiPinAntennaModel,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiPinAntennaModel_antennaGateAreaLayer(
        obj: *const lefiPinAntennaModel,
        index: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiPinAntennaModel_numAntennaMaxAreaCar(
        obj: *const lefiPinAntennaModel,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPinAntennaModel_antennaMaxAreaCar(
        obj: *const lefiPinAntennaModel,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiPinAntennaModel_antennaMaxAreaCarLayer(
        obj: *const lefiPinAntennaModel,
        index: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiPinAntennaModel_numAntennaMaxSideAreaCar(
        obj: *const lefiPinAntennaModel,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPinAntennaModel_antennaMaxSideAreaCar(
        obj: *const lefiPinAntennaModel,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiPinAntennaModel_antennaMaxSideAreaCarLayer(
        obj: *const lefiPinAntennaModel,
        index: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiPinAntennaModel_numAntennaMaxCutCar(
        obj: *const lefiPinAntennaModel,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPinAntennaModel_antennaMaxCutCar(
        obj: *const lefiPinAntennaModel,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiPinAntennaModel_antennaMaxCutCarLayer(
        obj: *const lefiPinAntennaModel,
        index: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiPinAntennaModel_hasReturn(obj: *const lefiPinAntennaModel) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasForeign(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasForeignOrient(
        obj: *const lefiPin,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasForeignPoint(
        obj: *const lefiPin,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasLEQ(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasDirection(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasUse(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasShape(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasMustjoin(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasOutMargin(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasOutResistance(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasInMargin(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasPower(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasLeakage(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasMaxload(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasMaxdelay(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasCapacitance(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasResistance(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasPulldownres(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasTieoffr(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasVHI(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasVLO(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasRiseVoltage(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasFallVoltage(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasRiseThresh(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasFallThresh(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasRiseSatcur(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasFallSatcur(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasCurrentSource(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasTables(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasAntennaSize(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasAntennaMetalArea(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasAntennaMetalLength(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasAntennaPartialMetalArea(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasAntennaPartialMetalSideArea(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasAntennaPartialCutArea(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasAntennaDiffArea(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasAntennaModel(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasTaperRule(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasRiseSlewLimit(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasFallSlewLimit(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasNetExpr(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasSupplySensitivity(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_hasGroundSensitivity(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_name(obj: *const lefiPin) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiPin_numPorts(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_port(obj: *const lefiPin, index: ::std::os::raw::c_int)
        -> *const lefiGeometries;
}
unsafe extern "C" {
    pub fn lefiPin_numForeigns(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_foreignName(
        obj: *const lefiPin,
        index: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiPin_taperRule(obj: *const lefiPin) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiPin_foreignOrient(
        obj: *const lefiPin,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_foreignOrientStr(
        obj: *const lefiPin,
        index: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiPin_foreignX(obj: *const lefiPin, index: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiPin_foreignY(obj: *const lefiPin, index: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiPin_LEQ(obj: *const lefiPin) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiPin_direction(obj: *const lefiPin) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiPin_use(obj: *const lefiPin) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiPin_shape(obj: *const lefiPin) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiPin_mustjoin(obj: *const lefiPin) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiPin_outMarginHigh(obj: *const lefiPin) -> f64;
}
unsafe extern "C" {
    pub fn lefiPin_outMarginLow(obj: *const lefiPin) -> f64;
}
unsafe extern "C" {
    pub fn lefiPin_outResistanceHigh(obj: *const lefiPin) -> f64;
}
unsafe extern "C" {
    pub fn lefiPin_outResistanceLow(obj: *const lefiPin) -> f64;
}
unsafe extern "C" {
    pub fn lefiPin_inMarginHigh(obj: *const lefiPin) -> f64;
}
unsafe extern "C" {
    pub fn lefiPin_inMarginLow(obj: *const lefiPin) -> f64;
}
unsafe extern "C" {
    pub fn lefiPin_power(obj: *const lefiPin) -> f64;
}
unsafe extern "C" {
    pub fn lefiPin_leakage(obj: *const lefiPin) -> f64;
}
unsafe extern "C" {
    pub fn lefiPin_maxload(obj: *const lefiPin) -> f64;
}
unsafe extern "C" {
    pub fn lefiPin_maxdelay(obj: *const lefiPin) -> f64;
}
unsafe extern "C" {
    pub fn lefiPin_capacitance(obj: *const lefiPin) -> f64;
}
unsafe extern "C" {
    pub fn lefiPin_resistance(obj: *const lefiPin) -> f64;
}
unsafe extern "C" {
    pub fn lefiPin_pulldownres(obj: *const lefiPin) -> f64;
}
unsafe extern "C" {
    pub fn lefiPin_tieoffr(obj: *const lefiPin) -> f64;
}
unsafe extern "C" {
    pub fn lefiPin_VHI(obj: *const lefiPin) -> f64;
}
unsafe extern "C" {
    pub fn lefiPin_VLO(obj: *const lefiPin) -> f64;
}
unsafe extern "C" {
    pub fn lefiPin_riseVoltage(obj: *const lefiPin) -> f64;
}
unsafe extern "C" {
    pub fn lefiPin_fallVoltage(obj: *const lefiPin) -> f64;
}
unsafe extern "C" {
    pub fn lefiPin_riseThresh(obj: *const lefiPin) -> f64;
}
unsafe extern "C" {
    pub fn lefiPin_fallThresh(obj: *const lefiPin) -> f64;
}
unsafe extern "C" {
    pub fn lefiPin_riseSatcur(obj: *const lefiPin) -> f64;
}
unsafe extern "C" {
    pub fn lefiPin_fallSatcur(obj: *const lefiPin) -> f64;
}
unsafe extern "C" {
    pub fn lefiPin_riseSlewLimit(obj: *const lefiPin) -> f64;
}
unsafe extern "C" {
    pub fn lefiPin_fallSlewLimit(obj: *const lefiPin) -> f64;
}
unsafe extern "C" {
    pub fn lefiPin_currentSource(obj: *const lefiPin) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiPin_tableHighName(obj: *const lefiPin) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiPin_tableLowName(obj: *const lefiPin) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiPin_numAntennaSize(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_antennaSize(obj: *const lefiPin, index: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiPin_antennaSizeLayer(
        obj: *const lefiPin,
        index: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiPin_numAntennaMetalArea(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_antennaMetalArea(obj: *const lefiPin, index: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiPin_antennaMetalAreaLayer(
        obj: *const lefiPin,
        index: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiPin_numAntennaMetalLength(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_antennaMetalLength(obj: *const lefiPin, index: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiPin_antennaMetalLengthLayer(
        obj: *const lefiPin,
        index: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiPin_numAntennaPartialMetalArea(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_antennaPartialMetalArea(
        obj: *const lefiPin,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiPin_antennaPartialMetalAreaLayer(
        obj: *const lefiPin,
        index: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiPin_numAntennaPartialMetalSideArea(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_antennaPartialMetalSideArea(
        obj: *const lefiPin,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiPin_antennaPartialMetalSideAreaLayer(
        obj: *const lefiPin,
        index: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiPin_numAntennaPartialCutArea(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_antennaPartialCutArea(obj: *const lefiPin, index: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiPin_antennaPartialCutAreaLayer(
        obj: *const lefiPin,
        index: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiPin_numAntennaDiffArea(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_antennaDiffArea(obj: *const lefiPin, index: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiPin_antennaDiffAreaLayer(
        obj: *const lefiPin,
        index: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiPin_netExpr(obj: *const lefiPin) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiPin_supplySensitivity(obj: *const lefiPin) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiPin_groundSensitivity(obj: *const lefiPin) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiPin_numAntennaModel(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_antennaModel(
        obj: *const lefiPin,
        index: ::std::os::raw::c_int,
    ) -> *const lefiPinAntennaModel;
}
unsafe extern "C" {
    pub fn lefiPin_numProperties(obj: *const lefiPin) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_propName(
        obj: *const lefiPin,
        index: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiPin_propValue(
        obj: *const lefiPin,
        index: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiPin_propNum(obj: *const lefiPin, index: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiPin_propType(
        obj: *const lefiPin,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiPin_propIsNumber(
        obj: *const lefiPin,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_propIsString(
        obj: *const lefiPin,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiPin_print(obj: *const lefiPin, f: *mut FILE);
}
unsafe extern "C" {
    pub fn lefiDensity_numLayer(obj: *const lefiDensity) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiDensity_layerName(
        obj: *const lefiDensity,
        index: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiDensity_numRects(
        obj: *const lefiDensity,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiDensity_getRect(
        obj: *const lefiDensity,
        index: ::std::os::raw::c_int,
        rectIndex: ::std::os::raw::c_int,
    ) -> lefiGeomRect;
}
unsafe extern "C" {
    pub fn lefiDensity_densityValue(
        obj: *const lefiDensity,
        index: ::std::os::raw::c_int,
        rectIndex: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiDensity_print(obj: *const lefiDensity, f: *mut FILE);
}
unsafe extern "C" {
    pub fn lefiMacro_hasClass(obj: *const lefiMacro) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiMacro_hasGenerator(obj: *const lefiMacro) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiMacro_hasGenerate(obj: *const lefiMacro) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiMacro_hasPower(obj: *const lefiMacro) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiMacro_hasOrigin(obj: *const lefiMacro) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiMacro_hasEEQ(obj: *const lefiMacro) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiMacro_hasLEQ(obj: *const lefiMacro) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiMacro_hasSource(obj: *const lefiMacro) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiMacro_hasXSymmetry(obj: *const lefiMacro) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiMacro_hasYSymmetry(obj: *const lefiMacro) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiMacro_has90Symmetry(obj: *const lefiMacro) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiMacro_hasSiteName(obj: *const lefiMacro) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiMacro_hasSitePattern(obj: *const lefiMacro) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiMacro_hasSize(obj: *const lefiMacro) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiMacro_hasForeign(obj: *const lefiMacro) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiMacro_hasForeignOrigin(
        obj: *const lefiMacro,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiMacro_hasForeignOrient(
        obj: *const lefiMacro,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiMacro_hasForeignPoint(
        obj: *const lefiMacro,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiMacro_hasClockType(obj: *const lefiMacro) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiMacro_isBuffer(obj: *const lefiMacro) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiMacro_isInverter(obj: *const lefiMacro) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiMacro_isFixedMask(obj: *const lefiMacro) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiMacro_numSitePattern(obj: *const lefiMacro) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiMacro_numProperties(obj: *const lefiMacro) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiMacro_propName(
        obj: *const lefiMacro,
        index: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiMacro_propValue(
        obj: *const lefiMacro,
        index: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiMacro_propNum(obj: *const lefiMacro, index: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiMacro_propType(
        obj: *const lefiMacro,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiMacro_propIsNumber(
        obj: *const lefiMacro,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiMacro_propIsString(
        obj: *const lefiMacro,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiMacro_name(obj: *const lefiMacro) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiMacro_macroClass(obj: *const lefiMacro) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiMacro_generator(obj: *const lefiMacro) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiMacro_EEQ(obj: *const lefiMacro) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiMacro_LEQ(obj: *const lefiMacro) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiMacro_source(obj: *const lefiMacro) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiMacro_clockType(obj: *const lefiMacro) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiMacro_originX(obj: *const lefiMacro) -> f64;
}
unsafe extern "C" {
    pub fn lefiMacro_originY(obj: *const lefiMacro) -> f64;
}
unsafe extern "C" {
    pub fn lefiMacro_power(obj: *const lefiMacro) -> f64;
}
unsafe extern "C" {
    pub fn lefiMacro_generate(
        obj: *const lefiMacro,
        name1: *mut *mut ::std::os::raw::c_char,
        name2: *mut *mut ::std::os::raw::c_char,
    );
}
unsafe extern "C" {
    pub fn lefiMacro_sitePattern(
        obj: *const lefiMacro,
        index: ::std::os::raw::c_int,
    ) -> *const lefiSitePattern;
}
unsafe extern "C" {
    pub fn lefiMacro_siteName(obj: *const lefiMacro) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiMacro_sizeX(obj: *const lefiMacro) -> f64;
}
unsafe extern "C" {
    pub fn lefiMacro_sizeY(obj: *const lefiMacro) -> f64;
}
unsafe extern "C" {
    pub fn lefiMacro_numForeigns(obj: *const lefiMacro) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiMacro_foreignOrient(
        obj: *const lefiMacro,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiMacro_foreignOrientStr(
        obj: *const lefiMacro,
        index: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiMacro_foreignX(obj: *const lefiMacro, index: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiMacro_foreignY(obj: *const lefiMacro, index: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiMacro_foreignName(
        obj: *const lefiMacro,
        index: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiMacro_print(obj: *const lefiMacro, f: *mut FILE);
}
unsafe extern "C" {
    pub fn lefiUnits_hasDatabase(obj: *const lefiUnits) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiUnits_hasCapacitance(obj: *const lefiUnits) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiUnits_hasResistance(obj: *const lefiUnits) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiUnits_hasTime(obj: *const lefiUnits) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiUnits_hasPower(obj: *const lefiUnits) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiUnits_hasCurrent(obj: *const lefiUnits) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiUnits_hasVoltage(obj: *const lefiUnits) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiUnits_hasFrequency(obj: *const lefiUnits) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiUnits_databaseName(obj: *const lefiUnits) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiUnits_databaseNumber(obj: *const lefiUnits) -> f64;
}
unsafe extern "C" {
    pub fn lefiUnits_capacitance(obj: *const lefiUnits) -> f64;
}
unsafe extern "C" {
    pub fn lefiUnits_resistance(obj: *const lefiUnits) -> f64;
}
unsafe extern "C" {
    pub fn lefiUnits_time(obj: *const lefiUnits) -> f64;
}
unsafe extern "C" {
    pub fn lefiUnits_power(obj: *const lefiUnits) -> f64;
}
unsafe extern "C" {
    pub fn lefiUnits_current(obj: *const lefiUnits) -> f64;
}
unsafe extern "C" {
    pub fn lefiUnits_voltage(obj: *const lefiUnits) -> f64;
}
unsafe extern "C" {
    pub fn lefiUnits_frequency(obj: *const lefiUnits) -> f64;
}
unsafe extern "C" {
    pub fn lefiUnits_print(obj: *const lefiUnits, f: *mut FILE);
}
unsafe extern "C" {
    pub fn lefiNonDefault_name(obj: *const lefiNonDefault) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiNonDefault_hasHardspacing(obj: *const lefiNonDefault) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiNonDefault_numProps(obj: *const lefiNonDefault) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiNonDefault_propName(
        obj: *const lefiNonDefault,
        index: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiNonDefault_propValue(
        obj: *const lefiNonDefault,
        index: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiNonDefault_propNumber(
        obj: *const lefiNonDefault,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiNonDefault_propType(
        obj: *const lefiNonDefault,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiNonDefault_propIsNumber(
        obj: *const lefiNonDefault,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiNonDefault_propIsString(
        obj: *const lefiNonDefault,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiNonDefault_numLayers(obj: *const lefiNonDefault) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiNonDefault_layerName(
        obj: *const lefiNonDefault,
        index: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiNonDefault_hasLayerWidth(
        obj: *const lefiNonDefault,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiNonDefault_layerWidth(
        obj: *const lefiNonDefault,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiNonDefault_hasLayerSpacing(
        obj: *const lefiNonDefault,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiNonDefault_layerSpacing(
        obj: *const lefiNonDefault,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiNonDefault_hasLayerWireExtension(
        obj: *const lefiNonDefault,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiNonDefault_layerWireExtension(
        obj: *const lefiNonDefault,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiNonDefault_hasLayerResistance(
        obj: *const lefiNonDefault,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiNonDefault_layerResistance(
        obj: *const lefiNonDefault,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiNonDefault_hasLayerCapacitance(
        obj: *const lefiNonDefault,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiNonDefault_layerCapacitance(
        obj: *const lefiNonDefault,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiNonDefault_hasLayerEdgeCap(
        obj: *const lefiNonDefault,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiNonDefault_layerEdgeCap(
        obj: *const lefiNonDefault,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiNonDefault_hasLayerDiagWidth(
        obj: *const lefiNonDefault,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiNonDefault_layerDiagWidth(
        obj: *const lefiNonDefault,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiNonDefault_numVias(obj: *const lefiNonDefault) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiNonDefault_viaRule(
        obj: *const lefiNonDefault,
        index: ::std::os::raw::c_int,
    ) -> *const lefiVia;
}
unsafe extern "C" {
    pub fn lefiNonDefault_numSpacingRules(obj: *const lefiNonDefault) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiNonDefault_spacingRule(
        obj: *const lefiNonDefault,
        index: ::std::os::raw::c_int,
    ) -> *const lefiSpacing;
}
unsafe extern "C" {
    pub fn lefiNonDefault_numUseVia(obj: *const lefiNonDefault) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiNonDefault_viaName(
        obj: *const lefiNonDefault,
        index: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiNonDefault_numUseViaRule(obj: *const lefiNonDefault) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiNonDefault_viaRuleName(
        obj: *const lefiNonDefault,
        index: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiNonDefault_numMinCuts(obj: *const lefiNonDefault) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiNonDefault_cutLayerName(
        obj: *const lefiNonDefault,
        index: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiNonDefault_numCuts(
        obj: *const lefiNonDefault,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiViaLayer_getPolygon(
        obj: *const lefiViaLayer,
        index: ::std::os::raw::c_int,
    ) -> *mut lefiGeomPolygon;
}
unsafe extern "C" {
    pub fn lefiVia_hasDefault(obj: *const lefiVia) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiVia_hasGenerated(obj: *const lefiVia) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiVia_hasForeign(obj: *const lefiVia) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiVia_hasForeignPnt(obj: *const lefiVia) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiVia_hasForeignOrient(obj: *const lefiVia) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiVia_hasProperties(obj: *const lefiVia) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiVia_hasResistance(obj: *const lefiVia) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiVia_hasTopOfStack(obj: *const lefiVia) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiVia_numLayers(obj: *const lefiVia) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiVia_layerName(
        obj: *const lefiVia,
        layerNum: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiVia_numRects(
        obj: *const lefiVia,
        layerNum: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiVia_xl(
        obj: *const lefiVia,
        layerNum: ::std::os::raw::c_int,
        rectNum: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiVia_yl(
        obj: *const lefiVia,
        layerNum: ::std::os::raw::c_int,
        rectNum: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiVia_xh(
        obj: *const lefiVia,
        layerNum: ::std::os::raw::c_int,
        rectNum: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiVia_yh(
        obj: *const lefiVia,
        layerNum: ::std::os::raw::c_int,
        rectNum: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiVia_rectColorMask(
        obj: *const lefiVia,
        layerNum: ::std::os::raw::c_int,
        rectNum: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiVia_polyColorMask(
        obj: *const lefiVia,
        layerNum: ::std::os::raw::c_int,
        polyNum: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiVia_numPolygons(
        obj: *const lefiVia,
        layerNum: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiVia_getPolygon(
        obj: *const lefiVia,
        layerNum: ::std::os::raw::c_int,
        polyNum: ::std::os::raw::c_int,
    ) -> lefiGeomPolygon;
}
unsafe extern "C" {
    pub fn lefiVia_name(obj: *const lefiVia) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiVia_resistance(obj: *const lefiVia) -> f64;
}
unsafe extern "C" {
    pub fn lefiVia_numProperties(obj: *const lefiVia) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiVia_propName(
        obj: *const lefiVia,
        index: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiVia_propValue(
        obj: *const lefiVia,
        index: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiVia_propNumber(obj: *const lefiVia, index: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiVia_propType(
        obj: *const lefiVia,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiVia_propIsNumber(
        obj: *const lefiVia,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiVia_propIsString(
        obj: *const lefiVia,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiVia_foreign(obj: *const lefiVia) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiVia_foreignX(obj: *const lefiVia) -> f64;
}
unsafe extern "C" {
    pub fn lefiVia_foreignY(obj: *const lefiVia) -> f64;
}
unsafe extern "C" {
    pub fn lefiVia_foreignOrient(obj: *const lefiVia) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiVia_foreignOrientStr(obj: *const lefiVia) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiVia_hasViaRule(obj: *const lefiVia) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiVia_viaRuleName(obj: *const lefiVia) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiVia_xCutSize(obj: *const lefiVia) -> f64;
}
unsafe extern "C" {
    pub fn lefiVia_yCutSize(obj: *const lefiVia) -> f64;
}
unsafe extern "C" {
    pub fn lefiVia_botMetalLayer(obj: *const lefiVia) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiVia_cutLayer(obj: *const lefiVia) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiVia_topMetalLayer(obj: *const lefiVia) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiVia_xCutSpacing(obj: *const lefiVia) -> f64;
}
unsafe extern "C" {
    pub fn lefiVia_yCutSpacing(obj: *const lefiVia) -> f64;
}
unsafe extern "C" {
    pub fn lefiVia_xBotEnc(obj: *const lefiVia) -> f64;
}
unsafe extern "C" {
    pub fn lefiVia_yBotEnc(obj: *const lefiVia) -> f64;
}
unsafe extern "C" {
    pub fn lefiVia_xTopEnc(obj: *const lefiVia) -> f64;
}
unsafe extern "C" {
    pub fn lefiVia_yTopEnc(obj: *const lefiVia) -> f64;
}
unsafe extern "C" {
    pub fn lefiVia_hasRowCol(obj: *const lefiVia) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiVia_numCutRows(obj: *const lefiVia) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiVia_numCutCols(obj: *const lefiVia) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiVia_hasOrigin(obj: *const lefiVia) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiVia_xOffset(obj: *const lefiVia) -> f64;
}
unsafe extern "C" {
    pub fn lefiVia_yOffset(obj: *const lefiVia) -> f64;
}
unsafe extern "C" {
    pub fn lefiVia_hasOffset(obj: *const lefiVia) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiVia_xBotOffset(obj: *const lefiVia) -> f64;
}
unsafe extern "C" {
    pub fn lefiVia_yBotOffset(obj: *const lefiVia) -> f64;
}
unsafe extern "C" {
    pub fn lefiVia_xTopOffset(obj: *const lefiVia) -> f64;
}
unsafe extern "C" {
    pub fn lefiVia_yTopOffset(obj: *const lefiVia) -> f64;
}
unsafe extern "C" {
    pub fn lefiVia_hasCutPattern(obj: *const lefiVia) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiVia_cutPattern(obj: *const lefiVia) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiVia_print(obj: *const lefiVia, f: *mut FILE);
}
unsafe extern "C" {
    pub fn lefiArrayFloorPlan_numPatterns(obj: *const lefiArrayFloorPlan) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiArrayFloorPlan_pattern(
        obj: *const lefiArrayFloorPlan,
        index: ::std::os::raw::c_int,
    ) -> *const lefiSitePattern;
}
unsafe extern "C" {
    pub fn lefiArrayFloorPlan_typ(
        obj: *const lefiArrayFloorPlan,
        index: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiArrayFloorPlan_name(obj: *const lefiArrayFloorPlan)
        -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiArray_numSitePattern(obj: *const lefiArray) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiArray_numCanPlace(obj: *const lefiArray) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiArray_numCannotOccupy(obj: *const lefiArray) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiArray_numTrack(obj: *const lefiArray) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiArray_numGcell(obj: *const lefiArray) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiArray_hasDefaultCap(obj: *const lefiArray) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiArray_name(obj: *const lefiArray) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiArray_sitePattern(
        obj: *const lefiArray,
        index: ::std::os::raw::c_int,
    ) -> *const lefiSitePattern;
}
unsafe extern "C" {
    pub fn lefiArray_canPlace(
        obj: *const lefiArray,
        index: ::std::os::raw::c_int,
    ) -> *const lefiSitePattern;
}
unsafe extern "C" {
    pub fn lefiArray_cannotOccupy(
        obj: *const lefiArray,
        index: ::std::os::raw::c_int,
    ) -> *const lefiSitePattern;
}
unsafe extern "C" {
    pub fn lefiArray_track(
        obj: *const lefiArray,
        index: ::std::os::raw::c_int,
    ) -> *const lefiTrackPattern;
}
unsafe extern "C" {
    pub fn lefiArray_gcell(
        obj: *const lefiArray,
        index: ::std::os::raw::c_int,
    ) -> *const lefiGcellPattern;
}
unsafe extern "C" {
    pub fn lefiArray_tableSize(obj: *const lefiArray) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiArray_numDefaultCaps(obj: *const lefiArray) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiArray_defaultCapMinPins(
        obj: *const lefiArray,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiArray_defaultCap(obj: *const lefiArray, index: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiArray_numFloorPlans(obj: *const lefiArray) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiArray_floorPlanName(
        obj: *const lefiArray,
        index: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiArray_numSites(
        obj: *const lefiArray,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiArray_siteType(
        obj: *const lefiArray,
        floorIndex: ::std::os::raw::c_int,
        siteIndex: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiArray_site(
        obj: *const lefiArray,
        floorIndex: ::std::os::raw::c_int,
        siteIndex: ::std::os::raw::c_int,
    ) -> *const lefiSitePattern;
}
unsafe extern "C" {
    pub fn lefiArray_print(obj: *const lefiArray, f: *mut FILE);
}
unsafe extern "C" {
    pub fn lefiNoiseVictim_length(obj: *const lefiNoiseVictim) -> f64;
}
unsafe extern "C" {
    pub fn lefiNoiseVictim_numNoises(obj: *const lefiNoiseVictim) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiNoiseVictim_noise(obj: *const lefiNoiseVictim, index: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiNoiseResistance_numNums(obj: *const lefiNoiseResistance) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiNoiseResistance_num(
        obj: *const lefiNoiseResistance,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiNoiseResistance_numVictims(obj: *const lefiNoiseResistance)
        -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiNoiseResistance_victim(
        obj: *const lefiNoiseResistance,
        index: ::std::os::raw::c_int,
    ) -> *const lefiNoiseVictim;
}
unsafe extern "C" {
    pub fn lefiSetDebug(num: ::std::os::raw::c_int, value: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn lefiDebug(num: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiError(
        check: ::std::os::raw::c_int,
        msgNum: ::std::os::raw::c_int,
        msg: *const ::std::os::raw::c_char,
    );
}
unsafe extern "C" {
    pub fn CASE(x: *const ::std::os::raw::c_char) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefrEnableReadEncrypted();
}
pub const lefiAntennaEnum_lefiAntennaAR: lefiAntennaEnum = 1;
pub const lefiAntennaEnum_lefiAntennaDAR: lefiAntennaEnum = 2;
pub const lefiAntennaEnum_lefiAntennaCAR: lefiAntennaEnum = 3;
pub const lefiAntennaEnum_lefiAntennaCDAR: lefiAntennaEnum = 4;
pub const lefiAntennaEnum_lefiAntennaAF: lefiAntennaEnum = 5;
pub const lefiAntennaEnum_lefiAntennaSAR: lefiAntennaEnum = 6;
pub const lefiAntennaEnum_lefiAntennaDSAR: lefiAntennaEnum = 7;
pub const lefiAntennaEnum_lefiAntennaCSAR: lefiAntennaEnum = 8;
pub const lefiAntennaEnum_lefiAntennaCDSAR: lefiAntennaEnum = 9;
pub const lefiAntennaEnum_lefiAntennaSAF: lefiAntennaEnum = 10;
pub const lefiAntennaEnum_lefiAntennaO: lefiAntennaEnum = 11;
pub const lefiAntennaEnum_lefiAntennaADR: lefiAntennaEnum = 12;
pub type lefiAntennaEnum = ::std::os::raw::c_uint;
unsafe extern "C" {
    pub fn lefiAntennaPWL_numPWL(obj: *const lefiAntennaPWL) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayerDensity_type(obj: *const lefiLayerDensity) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiLayerDensity_hasOneEntry(obj: *const lefiLayerDensity) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayerDensity_oneEntry(obj: *const lefiLayerDensity) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayerDensity_numFrequency(obj: *const lefiLayerDensity) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayerDensity_frequency(
        obj: *const lefiLayerDensity,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayerDensity_numWidths(obj: *const lefiLayerDensity) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayerDensity_width(
        obj: *const lefiLayerDensity,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayerDensity_numTableEntries(obj: *const lefiLayerDensity) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayerDensity_tableEntry(
        obj: *const lefiLayerDensity,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayerDensity_numCutareas(obj: *const lefiLayerDensity) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayerDensity_cutArea(
        obj: *const lefiLayerDensity,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiParallel_numLength(obj: *const lefiParallel) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiParallel_numWidth(obj: *const lefiParallel) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiParallel_length(obj: *const lefiParallel, iLength: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiParallel_width(obj: *const lefiParallel, iWidth: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiParallel_widthSpacing(
        obj: *const lefiParallel,
        iWidth: ::std::os::raw::c_int,
        iWidthSpacing: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiInfluence_numInfluenceEntry(obj: *const lefiInfluence) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiInfluence_width(obj: *const lefiInfluence, index: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiInfluence_distance(obj: *const lefiInfluence, index: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiInfluence_spacing(obj: *const lefiInfluence, index: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiTwoWidths_numWidth(obj: *const lefiTwoWidths) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiTwoWidths_width(obj: *const lefiTwoWidths, iWidth: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiTwoWidths_hasWidthPRL(
        obj: *const lefiTwoWidths,
        iWidth: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiTwoWidths_widthPRL(obj: *const lefiTwoWidths, iWidth: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiTwoWidths_numWidthSpacing(
        obj: *const lefiTwoWidths,
        iWidth: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiTwoWidths_widthSpacing(
        obj: *const lefiTwoWidths,
        iWidth: ::std::os::raw::c_int,
        iWidthSpacing: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiSpacingTable_isInfluence(obj: *const lefiSpacingTable) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiSpacingTable_influence(obj: *const lefiSpacingTable) -> *const lefiInfluence;
}
unsafe extern "C" {
    pub fn lefiSpacingTable_isParallel(obj: *const lefiSpacingTable) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiSpacingTable_parallel(obj: *const lefiSpacingTable) -> *const lefiParallel;
}
unsafe extern "C" {
    pub fn lefiSpacingTable_twoWidths(obj: *const lefiSpacingTable) -> *const lefiTwoWidths;
}
unsafe extern "C" {
    pub fn lefiOrthogonal_numOrthogonal(obj: *const lefiOrthogonal) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiOrthogonal_cutWithin(
        obj: *const lefiOrthogonal,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiOrthogonal_orthoSpacing(
        obj: *const lefiOrthogonal,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiAntennaModel_hasAntennaAreaRatio(
        obj: *const lefiAntennaModel,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiAntennaModel_hasAntennaDiffAreaRatio(
        obj: *const lefiAntennaModel,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiAntennaModel_hasAntennaDiffAreaRatioPWL(
        obj: *const lefiAntennaModel,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiAntennaModel_hasAntennaCumAreaRatio(
        obj: *const lefiAntennaModel,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiAntennaModel_hasAntennaCumDiffAreaRatio(
        obj: *const lefiAntennaModel,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiAntennaModel_hasAntennaCumDiffAreaRatioPWL(
        obj: *const lefiAntennaModel,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiAntennaModel_hasAntennaAreaFactor(
        obj: *const lefiAntennaModel,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiAntennaModel_hasAntennaAreaFactorDUO(
        obj: *const lefiAntennaModel,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiAntennaModel_hasAntennaSideAreaRatio(
        obj: *const lefiAntennaModel,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiAntennaModel_hasAntennaDiffSideAreaRatio(
        obj: *const lefiAntennaModel,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiAntennaModel_hasAntennaDiffSideAreaRatioPWL(
        obj: *const lefiAntennaModel,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiAntennaModel_hasAntennaCumSideAreaRatio(
        obj: *const lefiAntennaModel,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiAntennaModel_hasAntennaCumDiffSideAreaRatio(
        obj: *const lefiAntennaModel,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiAntennaModel_hasAntennaCumDiffSideAreaRatioPWL(
        obj: *const lefiAntennaModel,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiAntennaModel_hasAntennaSideAreaFactor(
        obj: *const lefiAntennaModel,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiAntennaModel_hasAntennaSideAreaFactorDUO(
        obj: *const lefiAntennaModel,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiAntennaModel_hasAntennaCumRoutingPlusCut(
        obj: *const lefiAntennaModel,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiAntennaModel_hasAntennaGatePlusDiff(
        obj: *const lefiAntennaModel,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiAntennaModel_hasAntennaAreaMinusDiff(
        obj: *const lefiAntennaModel,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiAntennaModel_hasAntennaAreaDiffReducePWL(
        obj: *const lefiAntennaModel,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiAntennaModel_antennaOxide(
        obj: *const lefiAntennaModel,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiAntennaModel_antennaAreaRatio(obj: *const lefiAntennaModel) -> f64;
}
unsafe extern "C" {
    pub fn lefiAntennaModel_antennaDiffAreaRatio(obj: *const lefiAntennaModel) -> f64;
}
unsafe extern "C" {
    pub fn lefiAntennaModel_antennaDiffAreaRatioPWL(
        obj: *const lefiAntennaModel,
    ) -> *const lefiAntennaPWL;
}
unsafe extern "C" {
    pub fn lefiAntennaModel_antennaCumAreaRatio(obj: *const lefiAntennaModel) -> f64;
}
unsafe extern "C" {
    pub fn lefiAntennaModel_antennaCumDiffAreaRatio(obj: *const lefiAntennaModel) -> f64;
}
unsafe extern "C" {
    pub fn lefiAntennaModel_antennaCumDiffAreaRatioPWL(
        obj: *const lefiAntennaModel,
    ) -> *const lefiAntennaPWL;
}
unsafe extern "C" {
    pub fn lefiAntennaModel_antennaAreaFactor(obj: *const lefiAntennaModel) -> f64;
}
unsafe extern "C" {
    pub fn lefiAntennaModel_antennaSideAreaRatio(obj: *const lefiAntennaModel) -> f64;
}
unsafe extern "C" {
    pub fn lefiAntennaModel_antennaDiffSideAreaRatio(obj: *const lefiAntennaModel) -> f64;
}
unsafe extern "C" {
    pub fn lefiAntennaModel_antennaDiffSideAreaRatioPWL(
        obj: *const lefiAntennaModel,
    ) -> *const lefiAntennaPWL;
}
unsafe extern "C" {
    pub fn lefiAntennaModel_antennaCumSideAreaRatio(obj: *const lefiAntennaModel) -> f64;
}
unsafe extern "C" {
    pub fn lefiAntennaModel_antennaCumDiffSideAreaRatio(obj: *const lefiAntennaModel) -> f64;
}
unsafe extern "C" {
    pub fn lefiAntennaModel_antennaCumDiffSideAreaRatioPWL(
        obj: *const lefiAntennaModel,
    ) -> *const lefiAntennaPWL;
}
unsafe extern "C" {
    pub fn lefiAntennaModel_antennaSideAreaFactor(obj: *const lefiAntennaModel) -> f64;
}
unsafe extern "C" {
    pub fn lefiAntennaModel_antennaGatePlusDiff(obj: *const lefiAntennaModel) -> f64;
}
unsafe extern "C" {
    pub fn lefiAntennaModel_antennaAreaMinusDiff(obj: *const lefiAntennaModel) -> f64;
}
unsafe extern "C" {
    pub fn lefiAntennaModel_antennaAreaDiffReducePWL(
        obj: *const lefiAntennaModel,
    ) -> *const lefiAntennaPWL;
}
unsafe extern "C" {
    pub fn lefiLayer_hasType(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasLayerType(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasMask(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasPitch(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasXYPitch(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasOffset(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasXYOffset(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasWidth(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasArea(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasDiagPitch(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasXYDiagPitch(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasDiagWidth(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasDiagSpacing(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasSpacingNumber(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasSpacingName(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasSpacingLayerStack(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasSpacingAdjacent(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasSpacingCenterToCenter(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasSpacingRange(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasSpacingRangeUseLengthThreshold(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasSpacingRangeInfluence(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasSpacingRangeInfluenceRange(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasSpacingRangeRange(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasSpacingLengthThreshold(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasSpacingLengthThresholdRange(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasSpacingParallelOverlap(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasSpacingArea(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasSpacingEndOfLine(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasSpacingParellelEdge(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasSpacingTwoEdges(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasSpacingAdjacentExcept(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasSpacingSamenet(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasSpacingSamenetPGonly(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasSpacingNotchLength(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasSpacingEndOfNotchWidth(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasDirection(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasResistance(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasResistanceArray(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasCapacitance(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasCapacitanceArray(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasHeight(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasThickness(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasWireExtension(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasShrinkage(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasCapMultiplier(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasEdgeCap(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasAntennaLength(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasAntennaArea(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasCurrentDensityPoint(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasCurrentDensityArray(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasAccurrentDensity(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasDccurrentDensity(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_numProps(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_propName(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiLayer_propValue(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiLayer_propNumber(obj: *const lefiLayer, index: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_propType(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiLayer_propIsNumber(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_propIsString(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_numSpacing(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_numSpacingTable(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_spacingTable(obj: *const lefiLayer, index: ::std::os::raw::c_int) -> *const lefiSpacingTable;
}
unsafe extern "C" {
    pub fn lefiLayer_name(obj: *const lefiLayer) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiLayer_type(obj: *const lefiLayer) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiLayer_layerType(obj: *const lefiLayer) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiLayer_pitch(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_mask(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_pitchX(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_pitchY(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_offset(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_offsetX(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_offsetY(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_width(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_area(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_diagPitch(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_diagPitchX(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_diagPitchY(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_diagWidth(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_diagSpacing(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_spacing(obj: *const lefiLayer, index: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_spacingName(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiLayer_spacingAdjacentCuts(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_spacingAdjacentWithin(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_spacingArea(obj: *const lefiLayer, index: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_spacingRangeMin(obj: *const lefiLayer, index: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_spacingRangeMax(obj: *const lefiLayer, index: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_spacingRangeInfluence(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_spacingRangeInfluenceMin(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_spacingRangeInfluenceMax(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_spacingRangeRangeMin(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_spacingRangeRangeMax(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_spacingLengthThreshold(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_spacingLengthThresholdRangeMin(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_spacingLengthThresholdRangeMax(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_spacingEolWidth(obj: *const lefiLayer, index: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_spacingEolWithin(obj: *const lefiLayer, index: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_spacingParSpace(obj: *const lefiLayer, index: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_spacingParWithin(obj: *const lefiLayer, index: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_spacingNotchLength(obj: *const lefiLayer, index: ::std::os::raw::c_int)
        -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_spacingEndOfNotchWidth(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_spacingEndOfNotchSpacing(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_spacingEndOfNotchLength(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_numMinimumcut(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_minimumcut(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_minimumcutWidth(obj: *const lefiLayer, index: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_hasMinimumcutWithin(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_minimumcutWithin(obj: *const lefiLayer, index: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_hasMinimumcutConnection(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_minimumcutConnection(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiLayer_hasMinimumcutNumCuts(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_minimumcutLength(obj: *const lefiLayer, index: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_minimumcutDistance(obj: *const lefiLayer, index: ::std::os::raw::c_int)
        -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_direction(obj: *const lefiLayer) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiLayer_resistance(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_capacitance(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_height(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_wireExtension(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_thickness(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_shrinkage(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_capMultiplier(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_edgeCap(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_antennaLength(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_antennaArea(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_currentDensityPoint(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_currentDensityArray(
        obj: *const lefiLayer,
        numPoints: *mut ::std::os::raw::c_int,
        widths: *mut *mut f64,
        current: *mut *mut f64,
    );
}
unsafe extern "C" {
    pub fn lefiLayer_capacitanceArray(
        obj: *const lefiLayer,
        numPoints: *mut ::std::os::raw::c_int,
        widths: *mut *mut f64,
        resValues: *mut *mut f64,
    );
}
unsafe extern "C" {
    pub fn lefiLayer_resistanceArray(
        obj: *const lefiLayer,
        numPoints: *mut ::std::os::raw::c_int,
        widths: *mut *mut f64,
        capValues: *mut *mut f64,
    );
}
unsafe extern "C" {
    pub fn lefiLayer_numAccurrentDensity(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_accurrent(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> *const lefiLayerDensity;
}
unsafe extern "C" {
    pub fn lefiLayer_numDccurrentDensity(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_dccurrent(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> *const lefiLayerDensity;
}
unsafe extern "C" {
    pub fn lefiLayer_numAntennaModel(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_antennaModel(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> *const lefiAntennaModel;
}
unsafe extern "C" {
    pub fn lefiLayer_hasSlotWireWidth(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasSlotWireLength(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasSlotWidth(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasSlotLength(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasMaxAdjacentSlotSpacing(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasMaxCoaxialSlotSpacing(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasMaxEdgeSlotSpacing(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasSplitWireWidth(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasMinimumDensity(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasMaximumDensity(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasDensityCheckWindow(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasDensityCheckStep(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasFillActiveSpacing(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasMaxwidth(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasMinwidth(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasMinstep(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasProtrusion(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_slotWireWidth(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_slotWireLength(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_slotWidth(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_slotLength(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_maxAdjacentSlotSpacing(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_maxCoaxialSlotSpacing(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_maxEdgeSlotSpacing(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_splitWireWidth(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_minimumDensity(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_maximumDensity(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_densityCheckWindowLength(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_densityCheckWindowWidth(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_densityCheckStep(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_fillActiveSpacing(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_maxwidth(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_minwidth(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_protrusionWidth1(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_protrusionLength(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_protrusionWidth2(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_numMinstep(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_minstep(obj: *const lefiLayer, index: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_hasMinstepType(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_minstepType(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiLayer_hasMinstepLengthsum(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_minstepLengthsum(obj: *const lefiLayer, index: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_hasMinstepMaxedges(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_minstepMaxedges(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasMinstepMinAdjLength(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_minstepMinAdjLength(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_hasMinstepMinBetLength(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_minstepMinBetLength(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_hasMinstepXSameCorners(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_numMinenclosedarea(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_minenclosedarea(obj: *const lefiLayer, index: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_hasMinenclosedareaWidth(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_minenclosedareaWidth(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_numEnclosure(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasEnclosureRule(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_enclosureOverhang1(obj: *const lefiLayer, index: ::std::os::raw::c_int)
        -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_enclosureOverhang2(obj: *const lefiLayer, index: ::std::os::raw::c_int)
        -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_hasEnclosureWidth(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_enclosureMinWidth(obj: *const lefiLayer, index: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_hasEnclosureExceptExtraCut(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_enclosureExceptExtraCut(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_hasEnclosureMinLength(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_enclosureMinLength(obj: *const lefiLayer, index: ::std::os::raw::c_int)
        -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_numPreferEnclosure(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasPreferEnclosureRule(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_preferEnclosureOverhang1(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_preferEnclosureOverhang2(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_hasPreferEnclosureWidth(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_preferEnclosureMinWidth(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_hasResistancePerCut(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_resistancePerCut(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_hasDiagMinEdgeLength(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_diagMinEdgeLength(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_numMinSize(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_minSizeWidth(obj: *const lefiLayer, index: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_minSizeLength(obj: *const lefiLayer, index: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_hasMaxFloatingArea(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_maxFloatingArea(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_hasArraySpacing(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasLongArray(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_hasViaWidth(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_viaWidth(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_cutSpacing(obj: *const lefiLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_numArrayCuts(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_arrayCuts(
        obj: *const lefiLayer,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_arraySpacing(obj: *const lefiLayer, index: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_hasSpacingTableOrtho(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_orthogonal(obj: *const lefiLayer) -> *const lefiOrthogonal;
}
unsafe extern "C" {
    pub fn lefiLayer_lef58WidthTableOrtho(obj: *const lefiLayer, idx: ::std::os::raw::c_int)
        -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_lef58WidthTableOrthoValues(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_lef58WidthTableWrongDir(
        obj: *const lefiLayer,
        idx: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiLayer_lef58WidthTableWrongDirValues(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_need58PropsProcessing(obj: *const lefiLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiLayer_print(obj: *const lefiLayer, f: *mut FILE);
}
pub const lefiGeomEnum_lefiGeomUnknown: lefiGeomEnum = 0;
pub const lefiGeomEnum_lefiGeomLayerE: lefiGeomEnum = 1;
pub const lefiGeomEnum_lefiGeomLayerExceptPgNetE: lefiGeomEnum = 2;
pub const lefiGeomEnum_lefiGeomLayerMinSpacingE: lefiGeomEnum = 3;
pub const lefiGeomEnum_lefiGeomLayerRuleWidthE: lefiGeomEnum = 4;
pub const lefiGeomEnum_lefiGeomWidthE: lefiGeomEnum = 5;
pub const lefiGeomEnum_lefiGeomPathE: lefiGeomEnum = 6;
pub const lefiGeomEnum_lefiGeomPathIterE: lefiGeomEnum = 7;
pub const lefiGeomEnum_lefiGeomRectE: lefiGeomEnum = 8;
pub const lefiGeomEnum_lefiGeomRectIterE: lefiGeomEnum = 9;
pub const lefiGeomEnum_lefiGeomPolygonE: lefiGeomEnum = 10;
pub const lefiGeomEnum_lefiGeomPolygonIterE: lefiGeomEnum = 11;
pub const lefiGeomEnum_lefiGeomViaE: lefiGeomEnum = 12;
pub const lefiGeomEnum_lefiGeomViaIterE: lefiGeomEnum = 13;
pub const lefiGeomEnum_lefiGeomClassE: lefiGeomEnum = 14;
pub const lefiGeomEnum_lefiGeomEnd: lefiGeomEnum = 15;
pub type lefiGeomEnum = ::std::os::raw::c_uint;
unsafe extern "C" {
    pub fn lefiGeometries_numItems(obj: *const lefiGeometries) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiGeometries_itemType(
        obj: *const lefiGeometries,
        index: ::std::os::raw::c_int,
    ) -> lefiGeomEnum;
}
unsafe extern "C" {
    pub fn lefiGeometries_getRect(
        obj: *const lefiGeometries,
        index: ::std::os::raw::c_int,
    ) -> *mut lefiGeomRect;
}
unsafe extern "C" {
    pub fn lefiGeometries_getRectIter(
        obj: *const lefiGeometries,
        index: ::std::os::raw::c_int,
    ) -> *mut lefiGeomRectIter;
}
unsafe extern "C" {
    pub fn lefiGeometries_getPath(
        obj: *const lefiGeometries,
        index: ::std::os::raw::c_int,
    ) -> *mut lefiGeomPath;
}
unsafe extern "C" {
    pub fn lefiGeometries_getPathIter(
        obj: *const lefiGeometries,
        index: ::std::os::raw::c_int,
    ) -> *mut lefiGeomPathIter;
}
unsafe extern "C" {
    pub fn lefiGeometries_hasLayerExceptPgNet(
        obj: *const lefiGeometries,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiGeometries_getLayer(
        obj: *const lefiGeometries,
        index: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiGeometries_getLayerMinSpacing(
        obj: *const lefiGeometries,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiGeometries_getLayerRuleWidth(
        obj: *const lefiGeometries,
        index: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    pub fn lefiGeometries_getWidth(obj: *const lefiGeometries, index: ::std::os::raw::c_int)
        -> f64;
}
unsafe extern "C" {
    pub fn lefiGeometries_getPolygon(
        obj: *const lefiGeometries,
        index: ::std::os::raw::c_int,
    ) -> *mut lefiGeomPolygon;
}
unsafe extern "C" {
    pub fn lefiGeometries_getPolygonIter(
        obj: *const lefiGeometries,
        index: ::std::os::raw::c_int,
    ) -> *mut lefiGeomPolygonIter;
}
unsafe extern "C" {
    pub fn lefiGeometries_getClass(
        obj: *const lefiGeometries,
        index: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiGeometries_getVia(
        obj: *const lefiGeometries,
        index: ::std::os::raw::c_int,
    ) -> *mut lefiGeomVia;
}
unsafe extern "C" {
    pub fn lefiGeometries_getViaIter(
        obj: *const lefiGeometries,
        index: ::std::os::raw::c_int,
    ) -> *mut lefiGeomViaIter;
}
unsafe extern "C" {
    pub fn lefiGeometries_print(obj: *const lefiGeometries, f: *mut FILE);
}
unsafe extern "C" {
    pub fn lefiSpacing_hasStack(obj: *const lefiSpacing) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiSpacing_name1(obj: *const lefiSpacing) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiSpacing_name2(obj: *const lefiSpacing) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiSpacing_distance(obj: *const lefiSpacing) -> f64;
}
unsafe extern "C" {
    pub fn lefiSpacing_print(obj: *const lefiSpacing, f: *mut FILE);
}
unsafe extern "C" {
    pub fn lefiIRDrop_name(obj: *const lefiIRDrop) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiIRDrop_value1(obj: *const lefiIRDrop, index: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiIRDrop_value2(obj: *const lefiIRDrop, index: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiIRDrop_numValues(obj: *const lefiIRDrop) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiIRDrop_print(obj: *const lefiIRDrop, f: *mut FILE);
}
unsafe extern "C" {
    pub fn lefiMinFeature_one(obj: *const lefiMinFeature) -> f64;
}
unsafe extern "C" {
    pub fn lefiMinFeature_two(obj: *const lefiMinFeature) -> f64;
}
unsafe extern "C" {
    pub fn lefiMinFeature_print(obj: *const lefiMinFeature, f: *mut FILE);
}
unsafe extern "C" {
    pub fn lefiSite_name(obj: *const lefiSite) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiSite_hasClass(obj: *const lefiSite) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiSite_siteClass(obj: *const lefiSite) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiSite_sizeX(obj: *const lefiSite) -> f64;
}
unsafe extern "C" {
    pub fn lefiSite_sizeY(obj: *const lefiSite) -> f64;
}
unsafe extern "C" {
    pub fn lefiSite_hasSize(obj: *const lefiSite) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiSite_hasXSymmetry(obj: *const lefiSite) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiSite_hasYSymmetry(obj: *const lefiSite) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiSite_has90Symmetry(obj: *const lefiSite) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiSite_hasRowPattern(obj: *const lefiSite) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiSite_numSites(obj: *const lefiSite) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiSite_siteName(
        obj: *const lefiSite,
        index: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiSite_siteOrient(
        obj: *const lefiSite,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiSite_siteOrientStr(
        obj: *const lefiSite,
        index: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiSite_print(obj: *const lefiSite, f: *mut FILE);
}
unsafe extern "C" {
    pub fn lefiSitePattern_name(obj: *const lefiSitePattern) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiSitePattern_orient(obj: *const lefiSitePattern) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiSitePattern_orientStr(obj: *const lefiSitePattern) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiSitePattern_x(obj: *const lefiSitePattern) -> f64;
}
unsafe extern "C" {
    pub fn lefiSitePattern_y(obj: *const lefiSitePattern) -> f64;
}
unsafe extern "C" {
    pub fn lefiSitePattern_hasStepPattern(obj: *const lefiSitePattern) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiSitePattern_xStart(obj: *const lefiSitePattern) -> f64;
}
unsafe extern "C" {
    pub fn lefiSitePattern_yStart(obj: *const lefiSitePattern) -> f64;
}
unsafe extern "C" {
    pub fn lefiSitePattern_xStep(obj: *const lefiSitePattern) -> f64;
}
unsafe extern "C" {
    pub fn lefiSitePattern_yStep(obj: *const lefiSitePattern) -> f64;
}
unsafe extern "C" {
    pub fn lefiSitePattern_print(obj: *const lefiSitePattern, f: *mut FILE);
}
unsafe extern "C" {
    pub fn lefiTrackPattern_name(obj: *const lefiTrackPattern) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiTrackPattern_start(obj: *const lefiTrackPattern) -> f64;
}
unsafe extern "C" {
    pub fn lefiTrackPattern_numTracks(obj: *const lefiTrackPattern) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiTrackPattern_space(obj: *const lefiTrackPattern) -> f64;
}
unsafe extern "C" {
    pub fn lefiTrackPattern_numLayers(obj: *const lefiTrackPattern) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiTrackPattern_layerName(
        obj: *const lefiTrackPattern,
        index: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiTrackPattern_print(obj: *const lefiTrackPattern, f: *mut FILE);
}
unsafe extern "C" {
    pub fn lefiGcellPattern_name(obj: *const lefiGcellPattern) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiGcellPattern_start(obj: *const lefiGcellPattern) -> f64;
}
unsafe extern "C" {
    pub fn lefiGcellPattern_numCRs(obj: *const lefiGcellPattern) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiGcellPattern_space(obj: *const lefiGcellPattern) -> f64;
}
unsafe extern "C" {
    pub fn lefiGcellPattern_print(obj: *const lefiGcellPattern, f: *mut FILE);
}
unsafe extern "C" {
    pub fn lefiUseMinSpacing_name(obj: *const lefiUseMinSpacing) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiUseMinSpacing_value(obj: *const lefiUseMinSpacing) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiUseMinSpacing_print(obj: *const lefiUseMinSpacing, f: *mut FILE);
}
unsafe extern "C" {
    pub fn lefiMaxStackVia_maxStackVia(obj: *const lefiMaxStackVia) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiMaxStackVia_hasMaxStackViaRange(
        obj: *const lefiMaxStackVia,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiMaxStackVia_maxStackViaBottomLayer(
        obj: *const lefiMaxStackVia,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiMaxStackVia_maxStackViaTopLayer(
        obj: *const lefiMaxStackVia,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiMaxStackVia_print(obj: *const lefiMaxStackVia, f: *mut FILE);
}
unsafe extern "C" {
    pub fn lefiProp_string(obj: *const lefiProp) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiProp_propType(obj: *const lefiProp) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiProp_propName(obj: *const lefiProp) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiProp_dataType(obj: *const lefiProp) -> ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiProp_hasNumber(obj: *const lefiProp) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiProp_hasRange(obj: *const lefiProp) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiProp_hasString(obj: *const lefiProp) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiProp_hasNameMapString(obj: *const lefiProp) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiProp_number(obj: *const lefiProp) -> f64;
}
unsafe extern "C" {
    pub fn lefiProp_left(obj: *const lefiProp) -> f64;
}
unsafe extern "C" {
    pub fn lefiProp_right(obj: *const lefiProp) -> f64;
}
unsafe extern "C" {
    pub fn lefiProp_print(obj: *const lefiProp, f: *mut FILE);
}
unsafe extern "C" {
    pub fn lefiPropType_propType(
        obj: *const lefiPropType,
        name: *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiValidUser() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiUser() -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiOrientStr(orient: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn convert_name2num(versionName: *const ::std::os::raw::c_char) -> f64;
}
unsafe extern "C" {
    pub fn validateMaskNumber(num: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiViaRuleLayer_hasDirection(obj: *const lefiViaRuleLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiViaRuleLayer_hasEnclosure(obj: *const lefiViaRuleLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiViaRuleLayer_hasWidth(obj: *const lefiViaRuleLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiViaRuleLayer_hasResistance(obj: *const lefiViaRuleLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiViaRuleLayer_hasOverhang(obj: *const lefiViaRuleLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiViaRuleLayer_hasMetalOverhang(obj: *const lefiViaRuleLayer)
        -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiViaRuleLayer_hasSpacing(obj: *const lefiViaRuleLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiViaRuleLayer_hasRect(obj: *const lefiViaRuleLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiViaRuleLayer_name(obj: *const lefiViaRuleLayer) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiViaRuleLayer_isHorizontal(obj: *const lefiViaRuleLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiViaRuleLayer_isVertical(obj: *const lefiViaRuleLayer) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiViaRuleLayer_enclosureOverhang1(obj: *const lefiViaRuleLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiViaRuleLayer_enclosureOverhang2(obj: *const lefiViaRuleLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiViaRuleLayer_widthMin(obj: *const lefiViaRuleLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiViaRuleLayer_widthMax(obj: *const lefiViaRuleLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiViaRuleLayer_overhang(obj: *const lefiViaRuleLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiViaRuleLayer_metalOverhang(obj: *const lefiViaRuleLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiViaRuleLayer_resistance(obj: *const lefiViaRuleLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiViaRuleLayer_spacingStepX(obj: *const lefiViaRuleLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiViaRuleLayer_spacingStepY(obj: *const lefiViaRuleLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiViaRuleLayer_xl(obj: *const lefiViaRuleLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiViaRuleLayer_yl(obj: *const lefiViaRuleLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiViaRuleLayer_xh(obj: *const lefiViaRuleLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiViaRuleLayer_yh(obj: *const lefiViaRuleLayer) -> f64;
}
unsafe extern "C" {
    pub fn lefiViaRuleLayer_print(obj: *const lefiViaRuleLayer, f: *mut FILE);
}
unsafe extern "C" {
    pub fn lefiViaRule_hasGenerate(obj: *const lefiViaRule) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiViaRule_hasDefault(obj: *const lefiViaRule) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiViaRule_name(obj: *const lefiViaRule) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiViaRule_numLayers(obj: *const lefiViaRule) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiViaRule_layer(
        obj: *const lefiViaRule,
        index: ::std::os::raw::c_int,
    ) -> *const lefiViaRuleLayer;
}
unsafe extern "C" {
    pub fn lefiViaRule_numVias(obj: *const lefiViaRule) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiViaRule_viaName(
        obj: *const lefiViaRule,
        index: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiViaRule_numProps(obj: *const lefiViaRule) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiViaRule_propName(
        obj: *const lefiViaRule,
        index: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiViaRule_propValue(
        obj: *const lefiViaRule,
        index: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiViaRule_propNumber(obj: *const lefiViaRule, index: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn lefiViaRule_propType(
        obj: *const lefiViaRule,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefiViaRule_propIsNumber(
        obj: *const lefiViaRule,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiViaRule_propIsString(
        obj: *const lefiViaRule,
        index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefiViaRule_print(obj: *const lefiViaRule, f: *mut FILE);
}
unsafe extern "C" {
    pub fn lefwInit(f: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwInitCbk(f: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwEncrypt() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwCloseEncrypt() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwNewLine() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwVersion(
        vers1: ::std::os::raw::c_int,
        vers2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwCaseSensitive(caseSensitive: *const ::std::os::raw::c_char)
        -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwNoWireExtensionAtPin(
        noWireExt: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMinfeature(minFeatureX: f64, minFeatureY: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwDielectric(dielectric: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwBusBitChars(busBitChars: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwDividerChar(dividerChar: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwManufacturingGrid(grid: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwFixedMask() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwUseMinSpacing(
        type_: *const ::std::os::raw::c_char,
        onOff: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwClearanceMeasure(type_: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwAntennaInputGateArea(inputGateArea: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwAntennaInOutDiffArea(inOutDiffArea: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwAntennaOutputDiffArea(outputDiffArea: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwStartUnits() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwUnits(
        time: f64,
        capacitance: f64,
        resistance: f64,
        power: f64,
        current: f64,
        voltage: f64,
        database: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwUnitsFrequency(frequency: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwEndUnits() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwStartLayer(
        layerName: *const ::std::os::raw::c_char,
        type_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerMask(maskColor: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerWidth(minWidth: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerCutSpacing(spacing: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerCutSpacingCenterToCenter() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerCutSpacingSameNet() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerCutSpacingLayer(
        name2: *const ::std::os::raw::c_char,
        stack: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerCutSpacingAdjacent(
        viaCuts: ::std::os::raw::c_int,
        distance: f64,
        stack: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerCutSpacingParallel() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerCutSpacingArea(cutArea: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerCutSpacingEnd() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerCutSpacingTableOrtho(
        numSpacing: ::std::os::raw::c_int,
        cutWithins: *mut f64,
        orthoSpacings: *mut f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerArraySpacing(
        longArray: ::std::os::raw::c_int,
        viaWidth: f64,
        cutSpacing: f64,
        numArrayCut: ::std::os::raw::c_int,
        arrayCuts: *mut ::std::os::raw::c_int,
        arraySpacings: *mut f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerEnclosure(
        location: *const ::std::os::raw::c_char,
        overhang1: f64,
        overhang2: f64,
        width: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerEnclosureWidth(
        location: *const ::std::os::raw::c_char,
        overhang1: f64,
        overhang2: f64,
        width: f64,
        cutWithin: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerEnclosureLength(
        location: *const ::std::os::raw::c_char,
        overhang1: f64,
        overhang2: f64,
        minLength: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerPreferEnclosure(
        location: *const ::std::os::raw::c_char,
        overhang1: f64,
        overhang2: f64,
        width: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerResistancePerCut(resistance: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwEndLayer(layerName: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwStartLayerRouting(layerName: *const ::std::os::raw::c_char)
        -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRouting(
        direction: *const ::std::os::raw::c_char,
        width: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingPitch(pitch: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingPitchXYDistance(xDistance: f64, yDistance: f64)
        -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingDiagPitch(distance: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingDiagPitchXYDistance(
        diag45Distance: f64,
        diag135Distance: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingDiagWidth(diagWidth: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingDiagSpacing(diagSpacing: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingDiagMinEdgeLength(diagLength: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingOffset(offset: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingOffsetXYDistance(
        xDistance: f64,
        yDistance: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingArea(area: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingMinsize(
        numRect: ::std::os::raw::c_int,
        minWidth: *mut f64,
        minLength: *mut f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingMinimumcut(numCuts: f64, minWidth: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingMinimumcutWithin(
        numCuts: f64,
        minWidth: f64,
        cutDistance: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingMinimumcutConnections(
        direction: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingMinimumcutLengthWithin(
        length: f64,
        distance: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingSpacing(spacing: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingSpacingRange(minWidth: f64, maxWidth: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingSpacingRangeUseLengthThreshold() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingSpacingRangeInfluence(
        infValue: f64,
        subMinWidth: f64,
        subMaxWidth: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingSpacingRangeRange(minWidth: f64, maxWidth: f64)
        -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingSpacingLengthThreshold(
        lengthValue: f64,
        minWidth: f64,
        maxWidth: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingSpacingSameNet(PGOnly: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingSpacingEndOfLine(eolWidth: f64, eolWithin: f64)
        -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingSpacingEOLParallel(
        parSpace: f64,
        parWithin: f64,
        twoEdges: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingSpacingNotchLength(minNLength: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingSpacingEndOfNotchWidth(
        eonWidth: f64,
        minNSpacing: f64,
        minNLength: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingWireExtension(wireExtension: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingResistance(
        resistance: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingCapacitance(
        capacitance: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingHeight(height: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingThickness(thickness: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingShrinkage(shrinkage: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingCapMultiplier(capMultiplier: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingEdgeCap(edgeCap: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingAntennaArea(antennaArea: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingAntennaLength(antennaLength: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingMaxwidth(width: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingMinwidth(width: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingMinenclosedarea(
        numMinenclosed: ::std::os::raw::c_int,
        area: *mut f64,
        width: *mut f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingMinstep(distance: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingMinstepWithOptions(
        distance: f64,
        rule: *const ::std::os::raw::c_char,
        maxLength: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingMinstepMaxEdges(distance: f64, maxEdges: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingProtrusion(
        width1: f64,
        length: f64,
        width2: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingStartSpacingtableParallel(
        numLength: ::std::os::raw::c_int,
        length: *mut f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingSpacingtableParallelWidth(
        width: f64,
        numSpacing: ::std::os::raw::c_int,
        spacing: *mut f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingStartSpacingtableInfluence() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingSpacingInfluenceWidth(
        width: f64,
        distance: f64,
        spacing: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingStartSpacingtableTwoWidths() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutingSpacingtableTwoWidthsWidth(
        width: f64,
        runLength: f64,
        numSpacing: ::std::os::raw::c_int,
        spacing: *mut f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerRoutineEndSpacingtable() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwEndLayerRouting(layerName: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerACCurrentDensity(
        type_: *const ::std::os::raw::c_char,
        value: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerACFrequency(
        numFrequency: ::std::os::raw::c_int,
        frequency: *mut f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerACWidth(
        numWidths: ::std::os::raw::c_int,
        widths: *mut f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerACCutarea(
        numCutareas: ::std::os::raw::c_int,
        cutareas: *mut f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerACTableEntries(
        numEntries: ::std::os::raw::c_int,
        entries: *mut f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerDCCurrentDensity(
        type_: *const ::std::os::raw::c_char,
        value: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerDCWidth(
        numWidths: ::std::os::raw::c_int,
        widths: *mut f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerDCCutarea(
        numCutareas: ::std::os::raw::c_int,
        cutareas: *mut f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerDCTableEntries(
        numEntries: ::std::os::raw::c_int,
        entries: *mut f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerAntennaModel(oxide: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerAntennaAreaRatio(value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerAntennaDiffAreaRatio(value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerAntennaDiffAreaRatioPwl(
        numPwls: ::std::os::raw::c_int,
        diffusions: *mut f64,
        ratios: *mut f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerAntennaCumAreaRatio(value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerAntennaCumDiffAreaRatio(value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerAntennaCumDiffAreaRatioPwl(
        numPwls: ::std::os::raw::c_int,
        diffusions: *mut f64,
        ratios: *mut f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerAntennaAreaFactor(
        value: f64,
        diffUseOnly: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerAntennaSideAreaRatio(value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerAntennaDiffSideAreaRatio(value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerAntennaDiffSideAreaRatioPwl(
        numPwls: ::std::os::raw::c_int,
        diffusions: *mut f64,
        ratios: *mut f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerAntennaCumSideAreaRatio(value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerAntennaCumDiffSideAreaRatio(value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerAntennaCumDiffSideAreaRatioPwl(
        numPwls: ::std::os::raw::c_int,
        diffusions: *mut f64,
        ratios: *mut f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerAntennaSideAreaFactor(
        value: f64,
        diffUseOnly: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerAntennaCumRoutingPlusCut() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerAntennaGatePlusDiff(plusDiffFactor: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerAntennaAreaMinusDiff(minusDiffFactor: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwLayerAntennaAreaDiffReducePwl(
        numPwls: ::std::os::raw::c_int,
        diffAreas: *mut f64,
        metalDiffFactors: *mut f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMinimumDensity(minDensity: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMaximumDensity(maxDensity: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwDensityCheckWindow(
        checkWindowLength: f64,
        checkWindowWidth: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwDensityCheckStep(checkStepValue: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwFillActiveSpacing(fillToActiveSpacing: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMaxviastack(
        value: ::std::os::raw::c_int,
        bottomLayer: *const ::std::os::raw::c_char,
        topLayer: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwStartPropDef() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwIntPropDef(
        objType: *const ::std::os::raw::c_char,
        propName: *const ::std::os::raw::c_char,
        leftRange: f64,
        rightRange: f64,
        propValue: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwRealPropDef(
        objType: *const ::std::os::raw::c_char,
        propName: *const ::std::os::raw::c_char,
        leftRange: f64,
        rightRange: f64,
        propValue: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwStringPropDef(
        objType: *const ::std::os::raw::c_char,
        propName: *const ::std::os::raw::c_char,
        leftRange: f64,
        rightRange: f64,
        propValue: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwEndPropDef() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwStartVia(
        viaName: *const ::std::os::raw::c_char,
        isDefault: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwViaTopofstackonly() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwViaForeign(
        foreignName: *const ::std::os::raw::c_char,
        xl: f64,
        yl: f64,
        orient: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwViaForeignStr(
        foreignName: *const ::std::os::raw::c_char,
        xl: f64,
        yl: f64,
        orient: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwViaResistance(resistance: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwViaLayer(layerName: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwViaLayerRect(
        x1l: f64,
        y1l: f64,
        x2l: f64,
        y2l: f64,
        mask: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwViaLayerPolygon(
        num_polys: ::std::os::raw::c_int,
        xl: *mut f64,
        yl: *mut f64,
        mask: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwViaViarule(
        viaRuleName: *const ::std::os::raw::c_char,
        xCutSize: f64,
        yCutSize: f64,
        botMetalLayer: *const ::std::os::raw::c_char,
        cutLayer: *const ::std::os::raw::c_char,
        topMetalLayer: *const ::std::os::raw::c_char,
        xCutSpacing: f64,
        yCutSpacing: f64,
        xBotEnc: f64,
        yBotEnc: f64,
        xTopEnc: f64,
        yTopEnc: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwViaViaruleRowCol(
        numCutRows: ::std::os::raw::c_int,
        numCutCols: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwViaViaruleOrigin(xOffset: f64, yOffset: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwViaViaruleOffset(
        xBotOffset: f64,
        yBotOffset: f64,
        xTopOffset: f64,
        yTopOffset: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwViaViarulePattern(
        cutPattern: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwStringProperty(
        propName: *const ::std::os::raw::c_char,
        propValue: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwRealProperty(
        propName: *const ::std::os::raw::c_char,
        propValue: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwIntProperty(
        propName: *const ::std::os::raw::c_char,
        propValue: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwEndVia(viaName: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwStartViaRule(viaRuleName: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwViaRuleLayer(
        layerName: *const ::std::os::raw::c_char,
        direction: *const ::std::os::raw::c_char,
        minWidth: f64,
        maxWidth: f64,
        overhang: f64,
        metalOverhang: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwViaRuleVia(viaName: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwEndViaRule(viaRuleName: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwStartViaRuleGen(viaRuleName: *const ::std::os::raw::c_char)
        -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwViaRuleGenDefault() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwViaRuleGenLayer(
        layerName: *const ::std::os::raw::c_char,
        direction: *const ::std::os::raw::c_char,
        minWidth: f64,
        maxWidth: f64,
        overhang: f64,
        metalOverhang: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwViaRuleGenLayerEnclosure(
        layerName: *const ::std::os::raw::c_char,
        overhang1: f64,
        overhang2: f64,
        minWidth: f64,
        maxWidth: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwViaRuleGenLayer3(
        layerName: *const ::std::os::raw::c_char,
        xl: f64,
        yl: f64,
        xh: f64,
        yh: f64,
        xSpacing: f64,
        ySpacing: f64,
        resistance: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwEndViaRuleGen(viaRuleName: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwStartNonDefaultRule(
        ruleName: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwNonDefaultRuleLayer(
        routingLayerName: *const ::std::os::raw::c_char,
        width: f64,
        minSpacing: f64,
        wireExtension: f64,
        resistance: f64,
        capacitance: f64,
        edgeCap: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwNonDefaultRuleHardspacing() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwNonDefaultRuleStartVia(
        viaName: *const ::std::os::raw::c_char,
        isDefault: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwNonDefaultRuleEndVia(
        viaName: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwNonDefaultRuleUseVia(
        viaName: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwNonDefaultRuleUseViaRule(
        viaRuleName: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwNonDefaultRuleMinCuts(
        layerName: *const ::std::os::raw::c_char,
        numCuts: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwEndNonDefaultRule(ruleName: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwStartSpacing() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwSpacing(
        layerName1: *const ::std::os::raw::c_char,
        layerName2: *const ::std::os::raw::c_char,
        minSpace: f64,
        stack: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwEndSpacing() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwUniversalNoiseMargin(high: f64, low: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwEdgeRateThreshold1(num: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwEdgeRateThreshold2(num: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwEdgeRateScaleFactor(num: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwStartNoiseTable(num: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwEdgeRate(num: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwOutputResistance(
        numResists: ::std::os::raw::c_int,
        resistance: *mut f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwVictims(
        length: ::std::os::raw::c_int,
        numNoises: ::std::os::raw::c_int,
        noises: *mut f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwEndNoiseTable() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwStartCorrectTable(num: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwEndCorrectTable() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMinFeature(x: f64, y: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwStartIrdrop() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwIrdropTable(
        tableName: *const ::std::os::raw::c_char,
        currentsNvolts: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwEndIrdrop() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwSite(
        siteName: *const ::std::os::raw::c_char,
        classType: *const ::std::os::raw::c_char,
        symmetry: *const ::std::os::raw::c_char,
        width: f64,
        height: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwSiteRowPattern(
        siteName: *const ::std::os::raw::c_char,
        orient: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwSiteRowPatternStr(
        siteName: *const ::std::os::raw::c_char,
        orient: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwEndSite(siteName: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwStartArray(arrayName: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwArraySite(
        name: *const ::std::os::raw::c_char,
        origX: f64,
        origY: f64,
        orient: ::std::os::raw::c_int,
        numX: f64,
        numY: f64,
        spaceX: f64,
        spaceY: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwArraySiteStr(
        name: *const ::std::os::raw::c_char,
        origX: f64,
        origY: f64,
        orient: *const ::std::os::raw::c_char,
        numX: f64,
        numY: f64,
        spaceX: f64,
        spaceY: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwArrayCanplace(
        name: *const ::std::os::raw::c_char,
        origX: f64,
        origY: f64,
        orient: ::std::os::raw::c_int,
        numX: f64,
        numY: f64,
        spaceX: f64,
        spaceY: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwArrayCanplaceStr(
        name: *const ::std::os::raw::c_char,
        origX: f64,
        origY: f64,
        orient: *const ::std::os::raw::c_char,
        numX: f64,
        numY: f64,
        spaceX: f64,
        spaceY: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwArrayCannotoccupy(
        name: *const ::std::os::raw::c_char,
        origX: f64,
        origY: f64,
        orient: ::std::os::raw::c_int,
        numX: f64,
        numY: f64,
        spaceX: f64,
        spaceY: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwArrayCannotoccupyStr(
        name: *const ::std::os::raw::c_char,
        origX: f64,
        origY: f64,
        orient: *const ::std::os::raw::c_char,
        numX: f64,
        numY: f64,
        spaceX: f64,
        spaceY: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwArrayTracks(
        xy: *const ::std::os::raw::c_char,
        start: f64,
        numTracks: ::std::os::raw::c_int,
        space: f64,
        layers: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwStartArrayFloorplan(name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwArrayFloorplan(
        site: *const ::std::os::raw::c_char,
        name: *const ::std::os::raw::c_char,
        origX: f64,
        origY: f64,
        orient: ::std::os::raw::c_int,
        numX: ::std::os::raw::c_int,
        numY: ::std::os::raw::c_int,
        spaceX: f64,
        spaceY: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwArrayFloorplanStr(
        site: *const ::std::os::raw::c_char,
        name: *const ::std::os::raw::c_char,
        origX: f64,
        origY: f64,
        orient: *const ::std::os::raw::c_char,
        numX: ::std::os::raw::c_int,
        numY: ::std::os::raw::c_int,
        spaceX: f64,
        spaceY: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwEndArrayFloorplan(name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwArrayGcellgrid(
        xy: *const ::std::os::raw::c_char,
        startXY: f64,
        colRows: ::std::os::raw::c_int,
        spaceXY: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwStartArrayDefaultCap(size: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwArrayDefaultCap(numPins: f64, cap: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwEndArrayDefaultCap() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwEndArray(arrayName: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwStartMacro(macroName: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroClass(
        value1: *const ::std::os::raw::c_char,
        value2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroFixedMask() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroSource(value1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroForeign(
        name: *const ::std::os::raw::c_char,
        xl: f64,
        yl: f64,
        orient: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroForeignStr(
        name: *const ::std::os::raw::c_char,
        xl: f64,
        yl: f64,
        orient: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroOrigin(xl: f64, yl: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroEEQ(macroName: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroLEQ(macroName: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroSize(width: f64, height: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroSymmetry(symmetry: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroSite(siteName: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroSitePattern(
        name: *const ::std::os::raw::c_char,
        origX: f64,
        origY: f64,
        orient: ::std::os::raw::c_int,
        numX: ::std::os::raw::c_int,
        numY: ::std::os::raw::c_int,
        spaceX: f64,
        spaceY: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroSitePatternStr(
        name: *const ::std::os::raw::c_char,
        origX: f64,
        origY: f64,
        orient: *const ::std::os::raw::c_char,
        numX: ::std::os::raw::c_int,
        numY: ::std::os::raw::c_int,
        spaceX: f64,
        spaceY: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPower(power: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwEndMacro(macroName: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwStartMacroDensity(layerName: *const ::std::os::raw::c_char)
        -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroDensityLayerRect(
        x1: f64,
        y1: f64,
        x2: f64,
        y2: f64,
        densityValue: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwEndMacroDensity() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwStartMacroPin(pinName: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinTaperRule(ruleName: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinForeign(
        name: *const ::std::os::raw::c_char,
        xl: f64,
        yl: f64,
        orient: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinForeignStr(
        name: *const ::std::os::raw::c_char,
        xl: f64,
        yl: f64,
        orient: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinLEQ(pinName: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinDirection(direction: *const ::std::os::raw::c_char)
        -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinUse(use_: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinShape(name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinMustjoin(name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinNetExpr(name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinSupplySensitivity(
        pinName: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinGroundSensitivity(
        pinName: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinOutputnoisemargin(
        high: ::std::os::raw::c_int,
        low: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinOutputresistance(
        high: ::std::os::raw::c_int,
        low: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinInputnoisemargin(
        high: ::std::os::raw::c_int,
        low: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinPower(power: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinLeakage(leakage: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinCapacitance(capacitance: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinResistance(resistance: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinPulldownres(resistance: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinTieoffr(resistance: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinVHI(voltage: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinVLO(voltage: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinRisevoltagethreshold(voltage: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinFallvoltagethreshold(voltage: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinRisethresh(capacitance: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinFallthresh(capacitance: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinRisesatcur(current: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinFallsatcur(current: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinCurrentsource(name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinIV_Tables(
        lowName: *const ::std::os::raw::c_char,
        highName: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinAntennasize(
        value: f64,
        layerName: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinAntennaMetalArea(
        value: f64,
        layerName: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinAntennaMetalLength(
        value: f64,
        layerName: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinAntennaPartialMetalArea(
        value: f64,
        layerName: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinAntennaPartialMetalSideArea(
        value: f64,
        layerName: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinAntennaPartialCutArea(
        value: f64,
        layerName: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinAntennaDiffArea(
        value: f64,
        layerName: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinAntennaModel(oxide: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinAntennaGateArea(
        value: f64,
        layerName: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinAntennaMaxAreaCar(
        value: f64,
        layerName: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinAntennaMaxSideAreaCar(
        value: f64,
        layerName: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinAntennaMaxCutCar(
        value: f64,
        layerName: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwEndMacroPin(pinName: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwStartMacroPinPort(classType: *const ::std::os::raw::c_char)
        -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinPortLayer(
        layerName: *const ::std::os::raw::c_char,
        spacing: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinPortDesignRuleWidth(
        layerName: *const ::std::os::raw::c_char,
        width: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinPortLayerWidth(width: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinPortLayerPath(
        num_paths: ::std::os::raw::c_int,
        xl: *mut f64,
        yl: *mut f64,
        numX: ::std::os::raw::c_int,
        numY: ::std::os::raw::c_int,
        spaceX: f64,
        spaceY: f64,
        mask: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinPortLayerRect(
        xl1: f64,
        yl1: f64,
        xl2: f64,
        yl2: f64,
        numX: ::std::os::raw::c_int,
        numY: ::std::os::raw::c_int,
        spaceX: f64,
        spaceY: f64,
        mask: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinPortLayerPolygon(
        num_polys: ::std::os::raw::c_int,
        xl: *mut f64,
        yl: *mut f64,
        numX: ::std::os::raw::c_int,
        numY: ::std::os::raw::c_int,
        spaceX: f64,
        spaceY: f64,
        mask: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroPinPortVia(
        xl: f64,
        yl: f64,
        viaName: *const ::std::os::raw::c_char,
        numX: ::std::os::raw::c_int,
        numY: ::std::os::raw::c_int,
        spaceX: f64,
        spaceY: f64,
        mask: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwEndMacroPinPort() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwStartMacroObs() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroObsLayer(
        layerName: *const ::std::os::raw::c_char,
        spacing: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroObsDesignRuleWidth(
        layerName: *const ::std::os::raw::c_char,
        width: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroExceptPGNet(layerName: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroObsLayerWidth(width: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroObsLayerPath(
        num_paths: ::std::os::raw::c_int,
        xl: *mut f64,
        yl: *mut f64,
        numX: ::std::os::raw::c_int,
        numY: ::std::os::raw::c_int,
        spaceX: f64,
        spaceY: f64,
        mask: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroObsLayerRect(
        xl1: f64,
        yl1: f64,
        xl2: f64,
        yl2: f64,
        numX: ::std::os::raw::c_int,
        numY: ::std::os::raw::c_int,
        spaceX: f64,
        spaceY: f64,
        mask: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroObsLayerPolygon(
        num_polys: ::std::os::raw::c_int,
        xl: *mut f64,
        yl: *mut f64,
        numX: ::std::os::raw::c_int,
        numY: ::std::os::raw::c_int,
        spaceX: f64,
        spaceY: f64,
        mask: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroObsVia(
        xl: f64,
        yl: f64,
        viaName: *const ::std::os::raw::c_char,
        numX: ::std::os::raw::c_int,
        numY: ::std::os::raw::c_int,
        spaceX: f64,
        spaceY: f64,
        mask: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwEndMacroObs() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwStartMacroTiming() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroTimingPin(
        fromPin: *const ::std::os::raw::c_char,
        toPin: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroTimingIntrinsic(
        riseFall: *const ::std::os::raw::c_char,
        min: f64,
        max: f64,
        slewT1: f64,
        slewT1Min: f64,
        slewT1Max: f64,
        slewT2: f64,
        slewT2Min: f64,
        slewT2Max: f64,
        slewT3: f64,
        varMin: f64,
        varMax: f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroTimingRisers(min: f64, max: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroTimingFallrs(min: f64, max: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroTimingRisecs(min: f64, max: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroTimingFallcs(min: f64, max: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroTimingRisesatt1(min: f64, max: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroTimingFallsatt1(min: f64, max: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroTimingRiset0(min: f64, max: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroTimingFallt0(min: f64, max: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwMacroTimingUnateness(
        unateness: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwEndMacroTiming() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwAntenna(type_: *const ::std::os::raw::c_char, value: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwStartBeginext(name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwBeginextCreator(creatorName: *const ::std::os::raw::c_char)
        -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwBeginextDate() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwBeginextRevision(
        vers1: ::std::os::raw::c_int,
        vers2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwBeginextSyntax(
        title: *const ::std::os::raw::c_char,
        string: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwEndBeginext() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwCurrentLineNumber() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwEnd() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwPrintError(status: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn lefwAddComment(comment: *const ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn lefwAddIndent();
}
unsafe extern "C" {
    pub fn lefrInit() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefrInitSession(startSession: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefrReset() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefrClear() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefrReleaseNResetMemory() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefrSetCommentChar(c: ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn lefrSetShiftCase();
}
unsafe extern "C" {
    pub fn lefrSetCaseSensitivity(caseSense: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn lefrFName() -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lefrRead(
        file: *mut FILE,
        fileName: *const ::std::os::raw::c_char,
        userData: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefrSetRegisterUnusedCallbacks();
}
unsafe extern "C" {
    pub fn lefrPrintUnusedCallbacks(f: *mut FILE);
}
unsafe extern "C" {
    pub fn lefrSetUserData(p0: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn lefrGetUserData() -> *mut ::std::os::raw::c_void;
}
pub const lefrCallbackType_e_lefrUnspecifiedCbkType: lefrCallbackType_e = 0;
pub const lefrCallbackType_e_lefrVersionCbkType: lefrCallbackType_e = 1;
pub const lefrCallbackType_e_lefrVersionStrCbkType: lefrCallbackType_e = 2;
pub const lefrCallbackType_e_lefrDividerCharCbkType: lefrCallbackType_e = 3;
pub const lefrCallbackType_e_lefrBusBitCharsCbkType: lefrCallbackType_e = 4;
pub const lefrCallbackType_e_lefrUnitsCbkType: lefrCallbackType_e = 5;
pub const lefrCallbackType_e_lefrCaseSensitiveCbkType: lefrCallbackType_e = 6;
pub const lefrCallbackType_e_lefrNoWireExtensionCbkType: lefrCallbackType_e = 7;
pub const lefrCallbackType_e_lefrPropBeginCbkType: lefrCallbackType_e = 8;
pub const lefrCallbackType_e_lefrPropCbkType: lefrCallbackType_e = 9;
pub const lefrCallbackType_e_lefrPropEndCbkType: lefrCallbackType_e = 10;
pub const lefrCallbackType_e_lefrLayerCbkType: lefrCallbackType_e = 11;
pub const lefrCallbackType_e_lefrViaCbkType: lefrCallbackType_e = 12;
pub const lefrCallbackType_e_lefrViaRuleCbkType: lefrCallbackType_e = 13;
pub const lefrCallbackType_e_lefrSpacingCbkType: lefrCallbackType_e = 14;
pub const lefrCallbackType_e_lefrIRDropCbkType: lefrCallbackType_e = 15;
pub const lefrCallbackType_e_lefrDielectricCbkType: lefrCallbackType_e = 16;
pub const lefrCallbackType_e_lefrMinFeatureCbkType: lefrCallbackType_e = 17;
pub const lefrCallbackType_e_lefrNonDefaultCbkType: lefrCallbackType_e = 18;
pub const lefrCallbackType_e_lefrSiteCbkType: lefrCallbackType_e = 19;
pub const lefrCallbackType_e_lefrMacroBeginCbkType: lefrCallbackType_e = 20;
pub const lefrCallbackType_e_lefrPinCbkType: lefrCallbackType_e = 21;
pub const lefrCallbackType_e_lefrMacroCbkType: lefrCallbackType_e = 22;
pub const lefrCallbackType_e_lefrObstructionCbkType: lefrCallbackType_e = 23;
pub const lefrCallbackType_e_lefrArrayCbkType: lefrCallbackType_e = 24;
pub const lefrCallbackType_e_lefrSpacingBeginCbkType: lefrCallbackType_e = 25;
pub const lefrCallbackType_e_lefrSpacingEndCbkType: lefrCallbackType_e = 26;
pub const lefrCallbackType_e_lefrArrayBeginCbkType: lefrCallbackType_e = 27;
pub const lefrCallbackType_e_lefrArrayEndCbkType: lefrCallbackType_e = 28;
pub const lefrCallbackType_e_lefrIRDropBeginCbkType: lefrCallbackType_e = 29;
pub const lefrCallbackType_e_lefrIRDropEndCbkType: lefrCallbackType_e = 30;
pub const lefrCallbackType_e_lefrNoiseMarginCbkType: lefrCallbackType_e = 31;
pub const lefrCallbackType_e_lefrEdgeRateThreshold1CbkType: lefrCallbackType_e = 32;
pub const lefrCallbackType_e_lefrEdgeRateThreshold2CbkType: lefrCallbackType_e = 33;
pub const lefrCallbackType_e_lefrEdgeRateScaleFactorCbkType: lefrCallbackType_e = 34;
pub const lefrCallbackType_e_lefrNoiseTableCbkType: lefrCallbackType_e = 35;
pub const lefrCallbackType_e_lefrCorrectionTableCbkType: lefrCallbackType_e = 36;
pub const lefrCallbackType_e_lefrInputAntennaCbkType: lefrCallbackType_e = 37;
pub const lefrCallbackType_e_lefrOutputAntennaCbkType: lefrCallbackType_e = 38;
pub const lefrCallbackType_e_lefrInoutAntennaCbkType: lefrCallbackType_e = 39;
pub const lefrCallbackType_e_lefrAntennaInputCbkType: lefrCallbackType_e = 40;
pub const lefrCallbackType_e_lefrAntennaInoutCbkType: lefrCallbackType_e = 41;
pub const lefrCallbackType_e_lefrAntennaOutputCbkType: lefrCallbackType_e = 42;
pub const lefrCallbackType_e_lefrManufacturingCbkType: lefrCallbackType_e = 43;
pub const lefrCallbackType_e_lefrUseMinSpacingCbkType: lefrCallbackType_e = 44;
pub const lefrCallbackType_e_lefrClearanceMeasureCbkType: lefrCallbackType_e = 45;
pub const lefrCallbackType_e_lefrTimingCbkType: lefrCallbackType_e = 46;
pub const lefrCallbackType_e_lefrMacroClassTypeCbkType: lefrCallbackType_e = 47;
pub const lefrCallbackType_e_lefrMacroOriginCbkType: lefrCallbackType_e = 48;
pub const lefrCallbackType_e_lefrMacroSizeCbkType: lefrCallbackType_e = 49;
pub const lefrCallbackType_e_lefrMacroFixedMaskCbkType: lefrCallbackType_e = 50;
pub const lefrCallbackType_e_lefrMacroEndCbkType: lefrCallbackType_e = 51;
pub const lefrCallbackType_e_lefrMaxStackViaCbkType: lefrCallbackType_e = 52;
pub const lefrCallbackType_e_lefrExtensionCbkType: lefrCallbackType_e = 53;
pub const lefrCallbackType_e_lefrDensityCbkType: lefrCallbackType_e = 54;
pub const lefrCallbackType_e_lefrFixedMaskCbkType: lefrCallbackType_e = 55;
pub const lefrCallbackType_e_lefrMacroSiteCbkType: lefrCallbackType_e = 56;
pub const lefrCallbackType_e_lefrMacroForeignCbkType: lefrCallbackType_e = 57;
pub const lefrCallbackType_e_lefrLibraryEndCbkType: lefrCallbackType_e = 58;
pub type lefrCallbackType_e = ::std::os::raw::c_uint;
pub type lefrVoidCbkFnType = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: lefrCallbackType_e,
        num: *mut ::std::os::raw::c_void,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type lefrStringCbkFnType = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: lefrCallbackType_e,
        string: *const ::std::os::raw::c_char,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type lefrIntegerCbkFnType = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: lefrCallbackType_e,
        number: ::std::os::raw::c_int,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type lefrDoubleCbkFnType = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: lefrCallbackType_e,
        number: f64,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type lefrUnitsCbkFnType = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: lefrCallbackType_e,
        units: *mut lefiUnits,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type lefrLayerCbkFnType = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: lefrCallbackType_e,
        l: *mut lefiLayer,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type lefrViaCbkFnType = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: lefrCallbackType_e,
        l: *mut lefiVia,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type lefrViaRuleCbkFnType = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: lefrCallbackType_e,
        l: *mut lefiViaRule,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type lefrSpacingCbkFnType = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: lefrCallbackType_e,
        l: *mut lefiSpacing,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type lefrIRDropCbkFnType = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: lefrCallbackType_e,
        l: *mut lefiIRDrop,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type lefrMinFeatureCbkFnType = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: lefrCallbackType_e,
        l: *mut lefiMinFeature,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type lefrNonDefaultCbkFnType = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: lefrCallbackType_e,
        l: *mut lefiNonDefault,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type lefrSiteCbkFnType = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: lefrCallbackType_e,
        l: *mut lefiSite,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type lefrMacroCbkFnType = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: lefrCallbackType_e,
        l: *mut lefiMacro,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type lefrPinCbkFnType = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: lefrCallbackType_e,
        l: *mut lefiPin,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type lefrObstructionCbkFnType = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: lefrCallbackType_e,
        l: *mut lefiObstruction,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type lefrArrayCbkFnType = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: lefrCallbackType_e,
        l: *mut lefiArray,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type lefrPropCbkFnType = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: lefrCallbackType_e,
        p: *mut lefiProp,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type lefrNoiseMarginCbkFnType = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: lefrCallbackType_e,
        p: *mut lefiNoiseMargin,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type lefrNoiseTableCbkFnType = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: lefrCallbackType_e,
        p: *mut lefiNoiseTable,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type lefrCorrectionTableCbkFnType = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: lefrCallbackType_e,
        p: *mut lefiCorrectionTable,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type lefrTimingCbkFnType = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: lefrCallbackType_e,
        p: *mut lefiTiming,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type lefrUseMinSpacingCbkFnType = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: lefrCallbackType_e,
        l: *mut lefiUseMinSpacing,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type lefrMaxStackViaCbkFnType = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: lefrCallbackType_e,
        l: *mut lefiMaxStackVia,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type lefrMacroNumCbkFnType = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: lefrCallbackType_e,
        l: lefiNum,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type lefrDensityCbkFnType = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: lefrCallbackType_e,
        l: *mut lefiDensity,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
unsafe extern "C" {
    pub fn lefrSetUnitsCbk(p0: lefrUnitsCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetVersionCbk(p0: lefrDoubleCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetVersionStrCbk(p0: lefrStringCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetDividerCharCbk(p0: lefrStringCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetBusBitCharsCbk(p0: lefrStringCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetNoWireExtensionCbk(p0: lefrStringCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetCaseSensitiveCbk(p0: lefrIntegerCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetPropBeginCbk(p0: lefrVoidCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetPropCbk(p0: lefrPropCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetPropEndCbk(p0: lefrVoidCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetLayerCbk(p0: lefrLayerCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetViaCbk(p0: lefrViaCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetViaRuleCbk(p0: lefrViaRuleCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetSpacingCbk(p0: lefrSpacingCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetIRDropCbk(p0: lefrIRDropCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetDielectricCbk(p0: lefrDoubleCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetMinFeatureCbk(p0: lefrMinFeatureCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetNonDefaultCbk(p0: lefrNonDefaultCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetSiteCbk(p0: lefrSiteCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetMacroBeginCbk(p0: lefrStringCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetPinCbk(p0: lefrPinCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetObstructionCbk(p0: lefrObstructionCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetArrayCbk(p0: lefrArrayCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetMacroCbk(p0: lefrMacroCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetLibraryEndCbk(p0: lefrVoidCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetTimingCbk(p0: lefrTimingCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetSpacingBeginCbk(p0: lefrVoidCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetSpacingEndCbk(p0: lefrVoidCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetArrayBeginCbk(p0: lefrStringCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetArrayEndCbk(p0: lefrStringCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetIRDropBeginCbk(p0: lefrVoidCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetIRDropEndCbk(p0: lefrVoidCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetNoiseMarginCbk(p0: lefrNoiseMarginCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetEdgeRateThreshold1Cbk(p0: lefrDoubleCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetEdgeRateThreshold2Cbk(p0: lefrDoubleCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetEdgeRateScaleFactorCbk(p0: lefrDoubleCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetNoiseTableCbk(p0: lefrNoiseTableCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetCorrectionTableCbk(p0: lefrCorrectionTableCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetInputAntennaCbk(p0: lefrDoubleCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetOutputAntennaCbk(p0: lefrDoubleCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetInoutAntennaCbk(p0: lefrDoubleCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetAntennaInputCbk(p0: lefrDoubleCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetAntennaInoutCbk(p0: lefrDoubleCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetAntennaOutputCbk(p0: lefrDoubleCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetClearanceMeasureCbk(p0: lefrStringCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetManufacturingCbk(p0: lefrDoubleCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetUseMinSpacingCbk(p0: lefrUseMinSpacingCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetMacroClassTypeCbk(p0: lefrStringCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetMacroOriginCbk(p0: lefrMacroNumCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetMacroSizeCbk(p0: lefrMacroNumCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetMacroFixedMaskCbk(p0: lefrIntegerCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetMacroEndCbk(p0: lefrStringCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetMaxStackViaCbk(p0: lefrMaxStackViaCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetExtensionCbk(p0: lefrStringCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetDensityCbk(p0: lefrDensityCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetFixedMaskCbk(p0: lefrIntegerCbkFnType);
}
unsafe extern "C" {
    pub fn lefrSetUnusedCallbacks(func: lefrVoidCbkFnType);
}
unsafe extern "C" {
    pub fn lefrUnsetCallbacks();
}
unsafe extern "C" {
    pub fn lefrUnsetAntennaInputCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetAntennaInoutCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetAntennaOutputCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetArrayBeginCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetArrayCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetArrayEndCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetBusBitCharsCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetCaseSensitiveCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetClearanceMeasureCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetCorrectionTableCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetDensityCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetDielectricCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetDividerCharCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetEdgeRateScaleFactorCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetEdgeRateThreshold1Cbk();
}
unsafe extern "C" {
    pub fn lefrUnsetEdgeRateThreshold2Cbk();
}
unsafe extern "C" {
    pub fn lefrUnsetExtensionCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetInoutAntennaCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetInputAntennaCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetIRDropBeginCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetIRDropCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetIRDropEndCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetLayerCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetLibraryEndCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetMacroBeginCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetMacroCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetMacroClassTypeCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetMacroEndCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetMacroOriginCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetMacroSizeCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetManufacturingCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetMaxStackViaCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetMinFeatureCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetNoiseMarginCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetNoiseTableCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetNonDefaultCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetNoWireExtensionCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetObstructionCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetOutputAntennaCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetPinCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetPropBeginCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetPropCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetPropEndCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetSiteCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetSpacingBeginCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetSpacingCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetSpacingEndCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetTimingCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetUseMinSpacingCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetUnitsCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetVersionCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetVersionStrCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetViaCbk();
}
unsafe extern "C" {
    pub fn lefrUnsetViaRuleCbk();
}
unsafe extern "C" {
    pub fn lefrLineNumber() -> ::std::os::raw::c_int;
}
pub type LEFI_LOG_FUNCTION =
    ::std::option::Option<unsafe extern "C" fn(arg1: *const ::std::os::raw::c_char)>;
unsafe extern "C" {
    pub fn lefrSetLogFunction(p0: LEFI_LOG_FUNCTION);
}
pub type LEFI_WARNING_LOG_FUNCTION =
    ::std::option::Option<unsafe extern "C" fn(arg1: *const ::std::os::raw::c_char)>;
unsafe extern "C" {
    pub fn lefrSetWarningLogFunction(p0: LEFI_WARNING_LOG_FUNCTION);
}
pub type LEFI_MALLOC_FUNCTION = ::std::option::Option<
    unsafe extern "C" fn(arg1: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_void,
>;
unsafe extern "C" {
    pub fn lefrSetMallocFunction(p0: LEFI_MALLOC_FUNCTION);
}
pub type LEFI_REALLOC_FUNCTION = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_void,
        arg2: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void,
>;
unsafe extern "C" {
    pub fn lefrSetReallocFunction(p0: LEFI_REALLOC_FUNCTION);
}
pub type LEFI_FREE_FUNCTION =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>;
unsafe extern "C" {
    pub fn lefrSetFreeFunction(p0: LEFI_FREE_FUNCTION);
}
pub type LEFI_LINE_NUMBER_FUNCTION =
    ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>;
unsafe extern "C" {
    pub fn lefrSetLineNumberFunction(p0: LEFI_LINE_NUMBER_FUNCTION);
}
unsafe extern "C" {
    pub fn lefrSetDeltaNumberLines(p0: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn lefrSetRelaxMode();
}
unsafe extern "C" {
    pub fn lefrUnsetRelaxMode();
}
unsafe extern "C" {
    pub fn lefrSetVersionValue(version: *const ::std::os::raw::c_char);
}
pub type LEFI_READ_FUNCTION = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut FILE, arg2: *mut ::std::os::raw::c_char, arg3: usize) -> usize,
>;
unsafe extern "C" {
    pub fn lefrSetReadFunction(p0: LEFI_READ_FUNCTION);
}
unsafe extern "C" {
    pub fn lefrUnsetReadFunction();
}
unsafe extern "C" {
    pub fn lefrSetOpenLogFileAppend();
}
unsafe extern "C" {
    pub fn lefrUnsetOpenLogFileAppend();
}
unsafe extern "C" {
    pub fn lefrDisablePropStrProcess();
}
unsafe extern "C" {
    pub fn lefrSetAntennaInoutWarnings(warn: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn lefrSetAntennaInputWarnings(warn: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn lefrSetAntennaOutputWarnings(warn: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn lefrSetArrayWarnings(warn: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn lefrSetCaseSensitiveWarnings(warn: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn lefrSetCorrectionTableWarnings(warn: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn lefrSetDielectricWarnings(warn: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn lefrSetEdgeRateThreshold1Warnings(warn: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn lefrSetEdgeRateThreshold2Warnings(warn: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn lefrSetEdgeRateScaleFactorWarnings(warn: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn lefrSetInoutAntennaWarnings(warn: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn lefrSetInputAntennaWarnings(warn: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn lefrSetIRDropWarnings(warn: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn lefrSetLayerWarnings(warn: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn lefrSetMacroWarnings(warn: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn lefrSetMaxStackViaWarnings(warn: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn lefrSetMinFeatureWarnings(warn: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn lefrSetNoiseMarginWarnings(warn: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn lefrSetNoiseTableWarnings(warn: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn lefrSetNonDefaultWarnings(warn: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn lefrSetNoWireExtensionWarnings(warn: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn lefrSetOutputAntennaWarnings(warn: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn lefrSetPinWarnings(warn: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn lefrSetSiteWarnings(warn: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn lefrSetSpacingWarnings(warn: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn lefrSetTimingWarnings(warn: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn lefrSetUnitsWarnings(warn: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn lefrSetUseMinSpacingWarnings(warn: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn lefrSetViaRuleWarnings(warn: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn lefrSetViaWarnings(warn: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn lefrDisableParserMsgs(nMsg: ::std::os::raw::c_int, msgs: *mut ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn lefrEnableParserMsgs(nMsg: ::std::os::raw::c_int, msgs: *mut ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn lefrEnableAllMsgs();
}
unsafe extern "C" {
    pub fn lefrDisableAllMsgs();
}
unsafe extern "C" {
    pub fn lefrSetTotalMsgLimit(totNumMsgs: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn lefrSetLimitPerMsg(msgId: ::std::os::raw::c_int, numMsg: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn lefwWrite(
        file: *mut FILE,
        fileName: *const ::std::os::raw::c_char,
        userData: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lefwSetRegisterUnusedCallbacks();
}
unsafe extern "C" {
    pub fn lefwPrintUnusedCallbacks(f: *mut FILE);
}
unsafe extern "C" {
    pub fn lefwSetUserData(p0: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn lefwGetUserData() -> *mut ::std::os::raw::c_void;
}
pub const lefwCallbackType_e_lefwUnspecifiedCbkType: lefwCallbackType_e = 0;
pub const lefwCallbackType_e_lefwVersionCbkType: lefwCallbackType_e = 1;
pub const lefwCallbackType_e_lefwCaseSensitiveCbkType: lefwCallbackType_e = 2;
pub const lefwCallbackType_e_lefwNoWireExtensionCbkType: lefwCallbackType_e = 3;
pub const lefwCallbackType_e_lefwBusBitCharsCbkType: lefwCallbackType_e = 4;
pub const lefwCallbackType_e_lefwDividerCharCbkType: lefwCallbackType_e = 5;
pub const lefwCallbackType_e_lefwManufacturingGridCbkType: lefwCallbackType_e = 6;
pub const lefwCallbackType_e_lefwUseMinSpacingCbkType: lefwCallbackType_e = 7;
pub const lefwCallbackType_e_lefwClearanceMeasureCbkType: lefwCallbackType_e = 8;
pub const lefwCallbackType_e_lefwUnitsCbkType: lefwCallbackType_e = 9;
pub const lefwCallbackType_e_lefwAntennaInputGateAreaCbkType: lefwCallbackType_e = 10;
pub const lefwCallbackType_e_lefwAntennaInOutDiffAreaCbkType: lefwCallbackType_e = 11;
pub const lefwCallbackType_e_lefwAntennaOutputDiffAreaCbkType: lefwCallbackType_e = 12;
pub const lefwCallbackType_e_lefwPropDefCbkType: lefwCallbackType_e = 13;
pub const lefwCallbackType_e_lefwLayerCbkType: lefwCallbackType_e = 14;
pub const lefwCallbackType_e_lefwViaCbkType: lefwCallbackType_e = 15;
pub const lefwCallbackType_e_lefwViaRuleCbkType: lefwCallbackType_e = 16;
pub const lefwCallbackType_e_lefwNonDefaultCbkType: lefwCallbackType_e = 17;
pub const lefwCallbackType_e_lefwCrossTalkCbkType: lefwCallbackType_e = 18;
pub const lefwCallbackType_e_lefwNoiseTableCbkType: lefwCallbackType_e = 19;
pub const lefwCallbackType_e_lefwCorrectionTableCbkType: lefwCallbackType_e = 20;
pub const lefwCallbackType_e_lefwSpacingCbkType: lefwCallbackType_e = 21;
pub const lefwCallbackType_e_lefwMinFeatureCbkType: lefwCallbackType_e = 22;
pub const lefwCallbackType_e_lefwDielectricCbkType: lefwCallbackType_e = 23;
pub const lefwCallbackType_e_lefwIRDropCbkType: lefwCallbackType_e = 24;
pub const lefwCallbackType_e_lefwSiteCbkType: lefwCallbackType_e = 25;
pub const lefwCallbackType_e_lefwArrayCbkType: lefwCallbackType_e = 26;
pub const lefwCallbackType_e_lefwMacroCbkType: lefwCallbackType_e = 27;
pub const lefwCallbackType_e_lefwAntennaCbkType: lefwCallbackType_e = 28;
pub const lefwCallbackType_e_lefwExtCbkType: lefwCallbackType_e = 29;
pub const lefwCallbackType_e_lefwEndLibCbkType: lefwCallbackType_e = 30;
pub type lefwCallbackType_e = ::std::os::raw::c_uint;
pub type lefwVoidCbkFnType = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: lefwCallbackType_e,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
unsafe extern "C" {
    pub fn lefwSetVersionCbk(p0: lefwVoidCbkFnType);
}
unsafe extern "C" {
    pub fn lefwSetCaseSensitiveCbk(p0: lefwVoidCbkFnType);
}
unsafe extern "C" {
    pub fn lefwSetNoWireExtensionCbk(p0: lefwVoidCbkFnType);
}
unsafe extern "C" {
    pub fn lefwSetBusBitCharsCbk(p0: lefwVoidCbkFnType);
}
unsafe extern "C" {
    pub fn lefwSetDividerCharCbk(p0: lefwVoidCbkFnType);
}
unsafe extern "C" {
    pub fn lefwSetManufacturingGridCbk(p0: lefwVoidCbkFnType);
}
unsafe extern "C" {
    pub fn lefwSetUseMinSpacingCbk(p0: lefwVoidCbkFnType);
}
unsafe extern "C" {
    pub fn lefwSetClearanceMeasureCbk(p0: lefwVoidCbkFnType);
}
unsafe extern "C" {
    pub fn lefwSetUnitsCbk(p0: lefwVoidCbkFnType);
}
unsafe extern "C" {
    pub fn lefwAntennaInputGateAreaCbk(p0: lefwVoidCbkFnType);
}
unsafe extern "C" {
    pub fn lefwAntennaInOutDiffAreaCbk(p0: lefwVoidCbkFnType);
}
unsafe extern "C" {
    pub fn lefwAntennaOutputDiffAreaCbk(p0: lefwVoidCbkFnType);
}
unsafe extern "C" {
    pub fn lefwSetPropDefCbk(p0: lefwVoidCbkFnType);
}
unsafe extern "C" {
    pub fn lefwSetLayerCbk(p0: lefwVoidCbkFnType);
}
unsafe extern "C" {
    pub fn lefwSetViaCbk(p0: lefwVoidCbkFnType);
}
unsafe extern "C" {
    pub fn lefwSetViaRuleCbk(p0: lefwVoidCbkFnType);
}
unsafe extern "C" {
    pub fn lefwSetNonDefaultCbk(p0: lefwVoidCbkFnType);
}
unsafe extern "C" {
    pub fn lefwSetCrossTalkCbk(p0: lefwVoidCbkFnType);
}
unsafe extern "C" {
    pub fn lefwSetNoiseTableCbk(p0: lefwVoidCbkFnType);
}
unsafe extern "C" {
    pub fn lefwSetCorrectionTableCbk(p0: lefwVoidCbkFnType);
}
unsafe extern "C" {
    pub fn lefwSetSpacingCbk(p0: lefwVoidCbkFnType);
}
unsafe extern "C" {
    pub fn lefwSetMinFeatureCbk(p0: lefwVoidCbkFnType);
}
unsafe extern "C" {
    pub fn lefwSetDielectricCbk(p0: lefwVoidCbkFnType);
}
unsafe extern "C" {
    pub fn lefwSetIRDropCbk(p0: lefwVoidCbkFnType);
}
unsafe extern "C" {
    pub fn lefwSetSiteCbk(p0: lefwVoidCbkFnType);
}
unsafe extern "C" {
    pub fn lefwSetArrayCbk(p0: lefwVoidCbkFnType);
}
unsafe extern "C" {
    pub fn lefwSetMacroCbk(p0: lefwVoidCbkFnType);
}
unsafe extern "C" {
    pub fn lefwSetAntennaCbk(p0: lefwVoidCbkFnType);
}
unsafe extern "C" {
    pub fn lefwSetExtCbk(p0: lefwVoidCbkFnType);
}
unsafe extern "C" {
    pub fn lefwSetEndLibCbk(p0: lefwVoidCbkFnType);
}
unsafe extern "C" {
    pub fn lefwSetUnusedCallbacks(func: lefwVoidCbkFnType);
}
unsafe extern "C" {
    pub fn lefwSetLogFunction(p0: LEFI_LOG_FUNCTION);
}
unsafe extern "C" {
    pub fn lefwSetWarningLogFunction(p0: LEFI_WARNING_LOG_FUNCTION);
}
pub type __builtin_va_list = [__va_list_tag; 1usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __va_list_tag {
    pub gp_offset: ::std::os::raw::c_uint,
    pub fp_offset: ::std::os::raw::c_uint,
    pub overflow_arg_area: *mut ::std::os::raw::c_void,
    pub reg_save_area: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __va_list_tag"][::std::mem::size_of::<__va_list_tag>() - 24usize];
    ["Alignment of __va_list_tag"][::std::mem::align_of::<__va_list_tag>() - 8usize];
    ["Offset of field: __va_list_tag::gp_offset"]
        [::std::mem::offset_of!(__va_list_tag, gp_offset) - 0usize];
    ["Offset of field: __va_list_tag::fp_offset"]
        [::std::mem::offset_of!(__va_list_tag, fp_offset) - 4usize];
    ["Offset of field: __va_list_tag::overflow_arg_area"]
        [::std::mem::offset_of!(__va_list_tag, overflow_arg_area) - 8usize];
    ["Offset of field: __va_list_tag::reg_save_area"]
        [::std::mem::offset_of!(__va_list_tag, reg_save_area) - 16usize];
};
